[
  {
    "name": "Ms. Amena Karimyan",
    "image": "/img/Ambassadors/Ms. Amena Karimyan - Afghanistan.jpg",
    "ambassadorRole": "Ambassador",
    "about": "CEO and Founder of KAYHANA Afghanistan Astronomical Private, #BBC100Women2021 Engineer, technical surveyor, Civil society activist, civil engineer, Astronomer and Author"
  },
  {
    "name": "​Ms. Alba Mustafaj",
    "image": "/img/Ambassadors/​Ms. Alba Mustafaj.jpg",
    "ambassadorRole": "Ambassador",
    "about": "​Ms. Alba Mustafaj Software Engineer & Bar Raiser @Amazon, Winner of \"Technology All Star\" and \"STEM Outreach Champion\" Awards, Women in Tech Ambassador, University Engagement Program Founder, Emotional Intelligence Evangelist"
  },
  
  {
    "name": "Ms. Yango Ndofula",
    "image": "/img/Ambassadors/Ms. Yango Ndofula - Angola.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Yango Ndofula is a programmer with a degree in Computer Engineering and Telecommunications, Programming Mentor, Developer, and Project Manager."
  },
  {
    "name": "Dr. Abigail Ganopol",
    "image": "/img/Ambassadors/Dr. Abigail Ganopol - Argentina.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Abigail Ganopol Dr. Abigail Ganopol has a PhD in Physics from the Faculty of Exact and Natural Sciences of the University of Buenos Aires, Argentina. Her field of expertise is the management of Low Earth Orbit Satellite Mission Operations. She has been A team leader during the design, implementation, validation, and operations execution of different satellite missions and was honored by NASA for her work in one of these missions. For several years she worked on developing and implementing a continuous improvement method with a lessons learned process at its core. She is also a faculty professor. A Passionate advocate for Nature, she is an active member of her community's civil defense. As part of her commitment to gender equity causes, she was appointed as the 2023 mentor for UNOOSA's Space4Women program and represented Argentina in the 2023 Space4Women Expert Meeting in Canada. Her curious and restless nature led her to found \"NUT Gestión del Tiempo\" to improve people's quality of life by teaching time management through a holistic approach. She is the author of the book “Es Tiempo del Tiempo” (2019) and several articles published online."
  },
  {
    "name": "Ms. Hanna Harutyunyan",
    "image": "/img/Ambassadors/Ms. Hanna Harutyunyan - Armenia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Robotics engineering student with over 6+ years of IT project management work experience. Pursuing Bachelor studies in robotics engineering, she's actively engaged in various space related projects, combining technical skills with project leadership, aspiring to innovate and contribute to the future of space exploration."
  },
  {
    "name": "Marie-Nathalie Jauffret",
    "image": "/img/Ambassadors/Dr_  Marie-Nathalie Jauffret Monaco Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "A specialist in biodigitalization, communication, and corporate social responsibility (CSR), I bridge the gap between visionary concepts and real-world results. With extensive field experience and advanced academic research, I work with multicultural teams to help businesses improve their impact and implement safe, sustainable, and innovative strategies. My internationally recognized publications contribute to strengthening the strategic leadership and long-term sustainability of the organizations I collaborate with."
  },
  {
    "name": "Ms. Sukruthi Narayanan",
    "image": "/img/Ambassadors/Ms. Sukruti Narayanan - Australia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sukruti Narayanan is a versatile communications professional and entrepreneur with expertise in media, public relations, stakeholder management, and technology. She is the Founder and CEO of The Hustler Journalist, an Australian media company addressing critical community issues, and serves as Director of Marketing & Operations at Rishi Tech, promoting the SURYA app for solar farm construction. As Co-founder of Bamboo Ventures, Sukruti supports startups led by young parents and under-20s, and as Chief of Business Development at Zentrix India, she drives global expansion of career exploration initiatives for kids in STEM. A recipient of the “Young Visionary” award, Sukruti combines her MBA in Public Relations with ongoing legal and digital business studies to make a lasting impact in education, technology, and social entrepreneurship."
  },
  {
    "name": "Ms. Carmen Engele",
    "image": "/img/Ambassadors/Ms. Carmen Engele - AUSTRIA.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Carmen Engele is an award-winning aspiring scientist and engineer with extensive experience in the space industry. Currently a student and teaching assistant of Computational Science and Engineering at ETH Zürich, she is passionate about advancing scientific knowledge and solving complex challenges across various fields, both academic and professional. Carmen actively engages in university mentoring and creates opportunities for her community, while striving to build her skill set and experiences across a wide range of disciplines, ranging from entrepreneurship to space law. With her dedication to progress and strong focus on collaboration, she is deeply involved in the Dutch, Portuguese, and Austrian space ecosystems, contributing to innovative projects such as a sounding rocket mission in Norway."
  },
  {
    "name": "Dr. Jacinta M. Higgs",
    "image": "/img/Ambassadors/Dr. Jacinta M. Higgs - Bahamas.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Jacinta M. Higgs is the Founder and President of Akhepran International Academy, an Afrocentric school in Fox Hill Village, The Bahamas. With over 40 years of experience, she is a distinguished educator, Climate Change Consultant, and African Cultural Expert. Dr. Higgs has held pivotal roles such as Director of the Sustainable Development Goals Unit in the Office of the Prime Minister and Director of Gender and Family Affairs at the Ministry of Social Services. She has represented The Bahamas internationally at the UN and Commonwealth meetings, including CEDAW and CSW. A former Senator and parliamentarian, Dr. Higgs also chaired Clifton Heritage National Park and served as an adjunct lecturer at the University of The Bahamas. Holding advanced degrees in education from the University of St. Thomas, Dr. Higgs is a devoted community advocate, investing in education and culture. She is a proud wife of 37 years, mother of four, and grandmother of three."
  },
  {
    "name": "Ms. Chiarath Olayindé Moutairou",
    "image": "/img/Ambassadors/Ms. Chiarath Olayindé Moutairou - Benin.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Passionate about development, education, and health, Chiarath Olayindé Moutairou is a trained medical biologist. She holds a master's degree in public health and has several years of experience managing grassroots development projects. A volunteer during her free time and an avid reader, Olayindé places great importance on community mobilization, which she sees as a valuable opportunity to learn from others, share knowledge, and strengthen human relationships. In both her volunteer activities and professional work, she actively advocates for girls' rights. She is committed to fostering a generation of empowered, healthy, and safe young girls. For Olayindé, girls' lack of access to education represents a significant waste of human potential. She believes that we cannot build a better world without fully valuing girls' potential."
  },
  {
    "name": "Ms. Sanjana Subramaniam",
    "image": "/img/Ambassadors/Ms_ Sanjana Subramaniam Malaysia Co-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sanjana Subramaniam is an entrepreneur with a solid foundation in sales and marketing, holding a bachelor's degree from Binary University. Driven by a passion for innovation and business growth, she has successfully embarked on entrepreneurial ventures, utilizing her expertise to achieve remarkable outcomes. Sanjana's journey reflects her commitment to excellence and her ability to navigate the dynamic landscape of entrepreneurship with confidence and determination."
  },
  {
    "name": "Ms. Houéfa Alexia Todan",
    "image": "/img/Ambassadors/Ms_ Houéfa Alexia Todan Benin Co-ambassador.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "A trained jurist and passionate advocate for the rights of children and girls, Houéfa devotes her energy to protecting the most vulnerable and promoting a more inclusive society. She supports young girls who are victims of violence through camps that offer safe spaces for expression, healing, and empowerment, while also leading regular outreach activities for children living on the streets. As a digital skills trainer, she introduces young people to the opportunities of the digital world and guides them toward promising career paths, helping them gain autonomy and preparing them to become future changemakers. She is also committed to the inclusion of deaf children through accessible education, awareness of sign language, and the creation of inclusive social spaces. Driven by a deep belief that every child deserves a nurturing and stimulating environment, she works daily to build a more equitable future where every voice, even the silent ones, can be heard"
  },
  {
    "name": "Ms. Meryn Zumbo Willetts",
    "image": "/img/Ambassadors/Ms_ Meryn Zumbo Willetts Norway Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Meryn Zumbo Willetts is the CEO and co-founder of Umbrella, operating at the nexus of innovation, recruitment, inclusive leadership, and systemic change. With a global career spanning the private and public sectors, Meryn has led initiatives in strategy, policy transformation, and startup acceleration. Her expertise lies in crafting go-to-market strategies, fostering inclusive leadership, and designing sustainable growth systems for diverse organizations. Meryn co-hosts the Modern Idealist Podcast, a platform for ambitious professionals driving meaningful change, and actively pursues her passion for the performing arts. She has performed in productions like Ernestine and is co-writing a play exploring Norwegian paradoxes. Driven by her commitment to reimagining the global workforce, Meryn envisions a fairer, more inclusive world where everyone feels valued and respected. She believes in leveraging business innovation and art to foster societal transformation and belonging."
  },
  {
    "name": "Ms. Achillia Giasmin Machfount Georgakopoulou",
    "image": "/img/Ambassadors/Ms_ Achillia Giasmin Machfount Georgakopoulou Greece Co-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Achillia Giasmin Machfount Georgakopoulou is a dynamic second-year Aerospace Science and Technology student at the University of Athens, concurrently studying at the Hebrew University of Jerusalem. A multifaceted talent, Achillia blends her passion for space science with artistic expression—training in pipe organ, piano, and church music—and is fluent in Greek, French, English, Hebrew, and Turkish, with certification in Hieroglyphs. Her academic pursuits span a diverse range of scientific courses including Earth and Space Science, Cryptology, Astronomy, and the New Space Economy, enriched by hands-on experiences in programs like the Kalamata Students Space Program and engagements with Blue Origin. Achillia has earned numerous accolades in Mathematics and Physics, including awards from the Greek and French Olympiads, and has contributed to scholarly publications and conferences. Proficient in specialized software such as STK, Matlab, AutoCAD, and SolidWorks, she seamlessly integrates technical expertise with creative innovation. Poised to become a leader in the global space industry, Achillia is committed to pushing the boundaries of science and inspiring the next generation of explorers."
  },
  {
    "name": "Mrs. Madhuri Moyde",
    "image": "/img/Ambassadors/Mrs_ Madhuri Moyde - Regional Communicator - Northern India.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Mrs. Madhuri Moyde, M.Sc. (Chemistry), M.Ed., is a distinguished educationist, social activist, environmentalist, columnist, and FEM speaker with over 25 years of dedicated service in education and community development. Serving as a Senior Chemistry Teacher at Daly College, Indore, since 2000, she mentors CBSE and IGCSE students while also leading as Community Service In-Charge and House Mistress, integrating academic excellence with values-based leadership. Beyond teaching, she is the Founder of Vijay Social Welfare Society, Director of Parikranti Foundation, and Madhya Pradesh Co-ordinator of Mission ShaktiSAT, where she has spearheaded large-scale initiatives in menstrual hygiene, child safety, women’s empowerment, skill development, environmental protection, and climate education, directly impacting thousands of beneficiaries across the state. Her outstanding contributions have earned her numerous awards, including the Rastramata Padmavati Award (2025), Amazing Indians Award (2025) by Adani Group & Times Now, and Narmadiya Gaurav Award (2024). A visionary leader, she continues to inspire change through education, sustainability, and social reform."
  },
  {
    "name": "Dr. Sunita",
    "image": "/img/Ambassadors/DR_ SUNITA COO (Non Tech) - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Dr. Sunita is a healthcare leader, entrepreneur, and social reformer with global clinical experience in the USA. She holds a Doctor of Pharmacy, Ph.D. in Health AI, MBA, Harvard Cancer Genomics certification, and Stanford CME credentials. After returning to India, she founded Eutuxia Global, Doctors Pharmacy, and BElegant X, advancing healthcare innovation and women’s empowerment. Her Ayusha Chakra initiative delivers mobile hospital services and breast cancer screening, supporting over 700 patients daily. She played a vital role during COVID-19 by supplying medicines and oxygen. Honored nationally and internationally, she also mentors young women as Regional Director for Miss Universe Telangana, Andhra Pradesh, and Goa."
  },
  {
    "name": "Dr. Hana Aouinet",
    "image": "/img/Ambassadors/Dr_ Hana Aouinet France Co-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Dr. Hana Aouinet is a dual-PhD space engineering expert with degrees in Numerical Modelling, Fluid Mechanics, and Hydraulic Engineering from ENIT and INSA Toulouse. Recognized by UNOOSA’s Space4Women program, she has led major international space projects and actively promotes opportunities, scholarships, and STEM pathways for students worldwide. A strong advocate for women in aerospace, she frequently appears in media and serves as France Country Chair for Space Technology and Aviation within G100. She is a professor and researcher at ELISA Aerospace, where she also directs the Student Space Center, and is a conference speaker and published scientific author in satellite development."
  },
  {
    "name": "Ms. Ariadna Celeste Pillaca Llanos",
    "image": "/img/Ambassadors/Ms_ Ariadna Celeste Pillaca Llanos Special Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Ariadna Celeste Pillaca Llanos is a 17-year-old Peruvian aspiring physicist and space education activist. Currently in her gap year, she is applying to universities in the USA, with MIT as her top choice. Passionate about astrophysics, she aims to pursue a Master’s and Ph.D. in the field. Beyond her love for space, she has diverse interests in music, psychology, philosophy, criminology, and law. Ariadna is dedicated to advancing the space sector and inspiring others through her advocacy and future research."
  },
  {
    "name": "Dr. Kanchi Das",
    "image": "/img/Ambassadors/Dr_ Kanchi Das Ambassador UAE, Qatar, Jordan, Oman, Egypt, Saudi, Bharain, Kuwait.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Dr. Kanchi Das, with over two decades in education, is a dynamic academic leader passionate about empowering students through innovative learning. Former Head of English, IBDP, and IBCP Coordinator at Dubai International Academy, she has driven curriculum excellence and diverse educational experiences. She has mentored students to top PISA Reading rankings, global competition wins, and admissions to leading universities. As a coach and consultant, she creates opportunities in AI, space technology, diplomacy, leadership, UN SDG projects, and sustainability, partnering with global experts and institutions. Dr. Das is dedicated to shaping ethical, critically-minded leaders who help change the world."
  },
  {
    "name": "Dr. Georgina Chávez",
    "image": "/img/Ambassadors/Dr. Georgina Chávez  - Bolivia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Georgina Chávez holds a PhD in Chemical Engineering from Lund University, working in the Research Coordination unit at Universidad Católica Boliviana “San Pablo” in La Paz Bolivia where she is also is a lecturer in Molecular and Cellular Biology in the Biomedical Engineering carrer. She and her research team has been awarded in the second call of the HyperGES program funded by UNOOSA and ESA to study the effects of hypergravity in the osmotic fragility in red blood cells with the project “almost engineers” she currently wants to expands her project in schools."
  },
  {
    "name": "Ms. Beatrice Keneh",
    "image": "/img/Ambassadors/Ms_ Beatrice Keneh Ambassador Ghana.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Beatrice Keneh is an Aerospace Engineering student at Kwame Nkrumah University of Science and Technology (KNUST), Ghana, recognized for her leadership, adaptability, and academic excellence. She currently serves as Vice President of the Association of Aerospace Engineering Students at KNUST, where she drives academic initiatives, student development, and industry engagement. A two-time Provost’s List honoree, Beatrice consistently demonstrates dedication to academic and professional growth. She is also a Research Associate at the Space Tech and Aviation G100 Leadership Network under the Blue Marble Space Institute of Science and Technology, contributing to global space research and innovation. Passionate about advancing aerospace and space science, she excels in communication, problem-solving, and innovation. Her journey reflects a commitment to collaboration, continuous learning, and embracing emerging technologies, with a vision to contribute meaningfully to the aerospace sector and inspire the next generation of innovators."
  },
  {
    "name": "Ms. Marianne Fiona Pachanya",
    "image": "/img/Ambassadors/Ms_ Marianne Fiona Pachanya Malawi Co-Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Marianne Fiona Pachanya is a passionate tech enthusiast and a dedicated advocate for women in the tech industry. She is currently studying a Diploma in Computing and Information Technology at the University of Malawi, where she is gaining a strong foundation in technology and digital skills. Marianne is deeply committed to empowering other women in the tech space, believing that diversity and inclusion are essential for innovation and progress. As a girl in tech, she is driven by a desire to break barriers and create opportunities for underrepresented groups in the field. Marianne has a wide range of technical skills, including Arduino programming, cybersecurity training, and beginner HTML and CSS. She has also undertaken courses in cloud computing, further expanding her knowledge and expertise. Beyond her academic pursuits, she actively tutors computer studies and shares her knowledge freely with others. Marianne is a content creator who uses her platform to inspire and educate people about technology, particularly women who are just starting their journey in the tech world. Residing in Zomba Old Naisi, Marianne continues to inspire through her work, embodying the values of leadership, compassion, and community service. She is a proud advocate for women in tech and is determined to make a positive impact in the world through her passion for technology and her commitment to empowering others."
  },
  {
    "name": "Ms. Nonofo Angela Mogopodi",
    "image": "/img/Ambassadors/Ms. Nonofo Angela Mogopodi - Botswana.jpg",
    "ambassadorRole": "Ambassador",
    "about": "International Space teacher liaison, Vice president of the Mathematical Association of Botswana, Stream International Founder and Director, Globe Organizer by NASA through collaborations with the Government of Botswana and the U.S. Embassy in Botswana"
  },
  {
    "name": "Ms. Isadora Stefanhak Costa Arantes",
    "image": "/img/Ambassadors/Ms. Isadora Stefanhak Costa Arantes - Brazil .jpg",
    "ambassadorRole": "Ambassador",
    "about": "First Brazilian Woman Astronaut Candidate; NASA Ambassador for Astrobiology; Book Author; Researcher and Speaker."
  },
  
  {
    "name": "Ms. Sarinah Ziziumiza",
    "image": "/img/Ambassadors/Ms. Sarinah Ziziumiza - Brunei.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sarinah is a visionary leader in education and technology, merging her expertise in Mechanical Engineering and Technical Education to drive innovation and digital literacy. As the Head of the Centre for Technology Enhancement Learning (CTEL) at IBTE, she has led transformative initiatives integrating digitalization for learning. Beyond her professional roles, Sarinah is deeply committed to community-building, leading DigiNations, a network dedicated to promoting digital literacy and Industry 4.0 awareness. Recognized with prestigious awards like the APEC Digital Prosperity Award and Bett Asia EdTech Top 10, she is also an advocate for inclusivity through her work with Women Techmakers and Google Developer Group, making a lasting impact on Brunei’s educational and technological landscape."
  },
  {
    "name": "Ms. Farida Tiemtore",
    "image": "/img/Ambassadors/Ms. Farida Tiemtore - Burkina Faso.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Farida TIEMTORE is a blogger and digital enthusiast. She is also President of the Réseau des Héroïnes du Faso, a community of young girls working for the well-being of women in Burkina Faso. She is passionate about technology and its use for social good. Farida is also a youth advocate for the Sustainable Development Goals (SDGs) and works to promote gender equality."
  },
  {
    "name": "Ms. Lily R. Asongfac",
    "image": "/img/Ambassadors/Ms. Lily R. Asongfac - Cameroon.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Lily R. Asongfac is a dynamic telecommunications engineer renowned for her innovative problem-solving and strategic leadership. As Strategic Partnerships Manager at Space Hero Ltd, she achieved a remarkable 1500% increase in the partner portfolio by identifying underreached regions and executing tailored outreach campaigns. Her technical expertise was pivotal in designing a nanosatellite mission for the Gabonese Space Agency at NMD Ltd, showcasing her ability to navigate complex challenges for mission success. Passionate about inspiring the next generation, Lily founded the Aerospace Baby Project, engaging children in space outreach activities to spark interest in aerospace careers. As the National Point of Contact for the Space Generation Advisory Council in Cameroon, she promotes STEM education and organizes events to involve youth in space activities, and she started the Youths for Sustainable Space Development (Y4SSD) community. Lily's mentorship extends to supporting university students, enabling them to participate in international space events and conferences. Her achievements include receiving the Nebula Award, being selected as a TechWomen Fellow for the US Department of State, awarded as African Space Leader by the Space Generation Advisory Council and 2024 Emerging Space Leader by the International Astronautical Federation. Additionally, Lily was honored with selection for the Space Foundation Teacher Liaison flight 24, further recognizing her exceptional talent and dedication to advancing aerospace. In summary, Lily Asongfac's leadership, innovation, and commitment to mentorship make her a driving force in the African space industry and a beacon of inspiration for the next generation of space professionals."
  },
  {
    "name": "Ms. OUNGUEDOU ONANINA THÉRÈSE JOSÉPHINE",
    "image": "/img/Ambassadors/Ms. OUNGUEDOU ONANINA THÉRÈSE JOSÉPHINE - Cameroon.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Assistant Research 2 at Legal Affairs Division, National Coordinator Volunteer World Space Week, Founder & CEO of World Space Week Cameroon."
  },
  {
    "name": "Ms. Chenkplen Sandy",
    "image": "/img/Ambassadors/Mrs. Chenkplen Sandy - Canada.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Chenkplen is a multifaceted professional who embodies compassion and empowerment in every aspect of her life. Balancing her roles as a mother, wife, and professional, she has dedicated herself to uplifting others across various fields, including Engineering, IT, Graphic Design, Customer Service, Healthcare, and Community Outreach. Her global impact is highlighted by her work as a Keynote Speaker for the City of Toronto’s 2019 Refugee Rights Day and her involvement in numerous organizations focused on empowerment and support. As the founder of Igniting Hope, Chenkplen continues to inspire meaningful change, driven by her unwavering commitment to service, family, and making a positive impact."
  },
  {
    "name": "Mrs. Sidoine Louisa Makanda",
    "image": "/img/Ambassadors/_Mrs. Sidoine Louisa Makanda - Central African Republic.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Mrs. Sidoine Louisa MAKANDA is the Advisor on Gender and Social Affairs to the Presidency of the Central African Republic and the National Coordinator of Wali Mo Londo I Maï, an NGO with nationwide impact. With over 11 years of experience in community development and women's empowerment, she is a steadfast advocate for gender equality and social justice. Mrs. MAKANDA champions the education of young girls, supports victims of Gender-Based Violence, and promotes participatory methods to combat poverty and discriminatory practices. Her work involves designing and implementing conflict analysis and social development initiatives, uniting women from diverse backgrounds through mutual aid and enhanced tontine practices. Dedicated to improving women's living conditions, she provides critical support to those facing crises, helping them regain stability and autonomy. A passionate leader, Mrs. MAKANDA is committed to building a more equitable society in the Central African Republic."
  },
  {
    "name": "Ms. Victoria Valdivia Cerda",
    "image": "/img/Ambassadors/Ms. Victoria Valdivia Cerda - Chile.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Victoria Valdivia Cerda is political scientist from Chile, she holds a Magister degree in International Relations and student of PhD by Universidad de Santiago. Victoria has worked as a space policy advisor, contributing to the formulation of Chile's defense whitepaper (2017)and to the National Defence policy (2020). Currently, she is a Global fellow at the European Space Policy Institute and lecturer on “Space policies “ at the National Academy of Strategic and Politics Studies (ANEPE) from Ministry of Defence in Chile. On the new space sector, Victoria is CSO at Spacely Chile, the first Chilean organization member of the International Astronautical Federation. As a volunteer, Victoria has served as a mentor at the initiative of “space4women”, National Coordinator of WSW, and she is Chair for Chile of G100 “Space & Technology” wing. Also Victoria is the recipient of the first place at the GCSP 2024 prize on innovative futures."
  },
  {
    "name": "Dr. Pilar Zamora Acevedo",
    "image": "/img/Ambassadors/Dr. PILAR ZAMORA ACEVEDO - Colombia .jpg",
    "ambassadorRole": "Ambassador",
    "about": "Lawyer, Entrepreneur, Founder, and Executive Director of the Colombian Space Agency of private initiative, and Current Vice President of the International Federation of the Astronautic-IAF-For Developing And Emerging Countries."
  },
  {
    "name": "Dr. Leonora de Lemos Medina",
    "image": "/img/Ambassadors/Dr. Leonora de Lemos Medina  - Costa Rica.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Associate Professor in Mechanical Engineering at the Universidad de Costa Rica, where she has been teaching since 2001. She holds a Doctor of Education from Universidad de la Salle and two Master's degrees in Mechanical Engineering, specializing in the modernization of machines and thermal systems. Her research spans diverse fields, including aerospace engineering, gender studies in engineering, and biomimetic design. She has led projects such as the development of high-power solid fuel rockets and the design of inhalation chambers for toxicity tests. Leonora is an active participant in women in STEM initiatives and serves on various technical committees related to aerospace and engineering. She has published extensively, including contributions to international congresses and journals. In addition to her academic role, Leonora is also engaged in consultancy and engineering outreach projects."
  },
  {
    "name": "Ms. Aicha Gladys Traoré Née Atindekoun",
    "image": "/img/Ambassadors/_Ms. Aicha Gladys Traoré Née Atindekoun - Cote d’Ivoire (IVORY COAST).jpg",
    "ambassadorRole": "Ambassador",
    "about": "Aicha Gladys Traoré Née Atindekoun is a 35-year-old dedicated activist with a degree in Marketing and a Master's in Sustainable Development. In 2017, she co-founded Pro-kids Côte d'Ivoire, an organization focused on the education of vulnerable children and young girls. As the President, Aicha leads various projects, focusing on innovation, fundraising, and raising awareness about comprehensive sexuality education. She also works to train, support, and reintegrate underprivileged young mothers in cities across Côte d'Ivoire. Aicha’s dedication has earned her numerous accolades, including the COPAC Excellence Award in 2022 and the Youth Impact Award from CNJCI and UNFPA. She was also recognized with the national Human Rights Award for her organization's efforts to combat pregnancies during schooling. Aicha is an active member of the Youth Engagement and Protection Commission within CNJCI, where she serves as vice-president. Aiming to help 100 young mothers return to school or training centers, Aicha envisions creating an African fund for the education of vulnerable children and young girls, embodying resilience, courage, and commitment to her community."
  },
  {
    "name": "Ms. Dorina Girbovan",
    "image": "/img/Ambassadors/Dr. Dorina Girbovan - Romania.jpg",
    "ambassadorRole": "Ambassdor",
    "about": "Ms. Dorina Girbovan - Experienced Science Educator, International Space Ambassador, Trainer, and Speaker. As an experienced Canadian and Romanian educator and mentor, I am passionate about inspiring others to reach their full potential. I serve as a speaker and 360 science consultant, sharing insights and expertise to enhance educational experiences. ​ As the founder & CEO of Beyond The Stars Education, the only Romanian HESA via NASA Education International Space Ambassador and the G100 Romania Country Chair for the Space Technology & Aviation Wing, I bring a unique global perspective to training and development, fostering curiosity and innovation. ​ My mission is to open pathways for learners, guiding their professional journey towards knowledge and discovery."
  },
  {
    "name": "Ms. Hoda Awny El-Megharbel",
    "image": "/img/Ambassadors/Ms. Hoda El-Megharbel - Egypt.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Hoda Awny El-Megharbel is a System Design Engineer at the Satellite Communication and Navigation Department in the Egyptian Space Agency. She has worked in small satellite projects both in Egypt and Japan. She graduated from Kyushu Institute of Technology / Laboratory of Lean Satellite Enterprises and In- Orbit Experiments (LaSEINE) with a Masters Degree as part of the United Nations/Japan Long-term Fellowship Programme Post-graduate study on Nano-Satellite Technologies (PNST) in 2020. She has a Bachelor Degree in Electronics and Communication Engineering from Misr International University, Egypt. She is TechWomen 2024 Alumnae and Space Generation Advisory Council National Point of Contact in Egypt, Middle East Region and Moon Village Association National Coordinator, Egypt, North Africa."
  },
  {
    "name": "Ms. Sonia Castro",
    "image": "/img/Ambassadors/Ms. Sonia Castro - El Salvador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Industrial Engineer with a specialization in Corporate Finance and a Master's in Project Management, with a current PMP certification. I have 8 years of experience in technology and transformation projects within the aeromaintenance industry. Passionate about aerospace, I have contributed to projects like a meteorological probe and currently working in a CanSat with UCA. Additionally, I support an NGO managing school scholarships and serve as the Coordinator of Youth and Social Impact for the PMI El Salvador Chapter, promoting educational and social initiatives."
  },
  {
    "name": "Ms. Evangelina Nguema Ayaga",
    "image": "/img/Ambassadors/Ms. Evangelina Nguema Ayaga - Equatorial Guinea.jpg",
    "ambassadorRole": "Ambassador",
    "about": "International speaker, multi-award winner, including Chevening Scholar 2022-2023, Epic Women 2022, Global Women in Management: Advancing Women’s Economic Opportunities (GWIM 70), WAW HONORARY AWARD, Women Appreciating Women Hall of Fame 2021, and Mandela Washington Fellow for Young African Leaders 2016, G100 Global Networking Equatorial Guinea Chair, Vice President of the Ideal Woman Organization, a Board Member of Nethuman, the National Director of the Sorority Network Pact for Equatorial Guinea, and co-founder of the STEM Women program"
  },
  {
    "name": "Ms. Khulile Winifred Dlamini",
    "image": "/img/Ambassadors/Ms. Khulile Winifred Dlamini - Eswatini.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Eswatini Women in Science Engineering and Technology (ENWISET) Officer at Ministry of Communications & Information Technology, and An Advocate of WOMEN IN STEM"
  },
  {
    "name": "Ms. Gelila Berhanu Biramo",
    "image": "/img/Ambassadors/Ms. Gelila Berhanu Biramo - Ethiopia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Gelila Berhanu Biramo holds a Bachelor’s degree in Aerospace Engineering from KIIT, Bhubaneswar, India (2022), and a Master’s degree in Engineering Systems with a focus on space from Skoltech, Moscow, Russia. Gelila has been actively involved in various aerospace and space projects throughout her academic career and is currently working on space-related initiatives. She is eager to contribute to collaborative projects and engage with the global community."
  },
  {
    "name": "Ms. Eden Abeselom",
    "image": "/img/Ambassadors/Ms_ Eden Abeselom Ethiopia Tech Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Tech-Ambassador",
    "about": "Eden Abeselom is an aerospace engineer with a Master's degree in Space Engineering, currently working at the Space Science and Geospatial Institute in Ethiopia. Her research focuses on the attitude and orbit control systems of satellites, and she is actively involved in various projects related to Unmanned Aerial Vehicles (UAVs) and satellite technology. In addition to her research work, she participates in voluntary projects with the Space Generation Advisory Council (SGAC). Eden has been recognized for her contributions to the field, receiving the Emerging Space Leader (ESL) award from the International Astronautical Federation (IAF) and an award from the Italian Space Agency (ASI)."
  },
  {
    "name": "Ms. Mujgan Tahery",
    "image": "/img/Ambassadors/Ms_ Mujgan Tahery - Afganistan Co-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Tech-Ambassador",
    "about": "Mujgan Tahery is the visionary Founder and CEO of the Uniting Circle Multicultural Community Centre, a leading force in promoting cultural inclusivity, community empowerment, and social equity. Originally from Afghanistan, Mujgan brings a deep-rooted passion for social justice, dedicating her life to uplifting culturally and linguistically diverse (CALD) communities across Western Sydney. Through the Uniting Circle, she has built a dynamic hub that provides education, support services, and cultural programs to individuals and families from diverse backgrounds. Her work actively bridges cultural divides, fosters mutual understanding, and creates a welcoming space that honors Aboriginal and Torres Strait Islander peoples alongside global communities. Mujgan’s leadership is marked by innovation, empathy, and a strong commitment to inclusive development. Her team organizes impactful events and initiatives that celebrate multiculturalism, encourage collaboration, and inspire collective growth. She envisions a society where differences are embraced, voices are uplifted, and every person feels valued and connected. With her unwavering dedication, Mujgan continues to champion social cohesion and harmony, setting a powerful example for grassroots leadership and community-driven change in Australia and beyond."
  },
  {
    "name": "Ms. Sharina Shanaz",
    "image": "/img/Ambassadors/Ms. Sharina Shanaz - Fiji.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sharina Shanaz is a passionate educator, data analyst, and community advocate dedicated to empowering underserved communities. Hailing from Ba, Fiji Islands, and rising from a humble background, she has built a multifaceted career blending her expertise in computer science, mathematics, and education. With over a decade as a high school mathematics teacher, 10 years in data analytics, and 8 years as a committed Rotarian, Sharina champions equity, mentorship, and STEM education — inspiring young people, especially those from disadvantaged backgrounds, to pursue brighter futures."
  },
  {
    "name": "Dr. Priyanka Das Rajkakati",
    "image": "/img/Ambassadors/Dr_ Priyanka Das Rajkakati France Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Priyanka Das Rajkakati is an Indian-born French space scientist and artist, focused on actionable sustainability practices in the space industry for the benefit of society. Ethnically from Assam, she grew up in Delhi, moved to France in 2013, and has been invited to all 7 continents. Two of her demonstrative art-tech projects have been to space (ISS and the Moon). Currently, at vorteX-io, she is directing the EIC-Accelerator Project WHYLD towards a real-time river-forecasting service. With degrees from St. Stephen's College, Ecole-Polytechnique and a CIFRE Ph.D. from ISAE-Supaéro and Safran, she has numerous recognitions such as Forbes India 30under30, L'Oréal Woman of Worth, Karman Fellow, India Today Next 100 Innovators and France Alumni Ambassador."
  },
  {
    "name": "Dr. Mireille Toulekima",
    "image": "/img/Ambassadors/Mireille Toulekima.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Award-winning Engineer, Global Energy Advisor, Educator, Entrepreneur, Talk Show Host, Women Empowerment Advocate and Champion, and Published Author."
  },
  
  {
    "name": "Ms. Fatoumatta Jawara",
    "image": "/img/Ambassadors/Ms_ Fatuamatta Jawara Gambia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Ministry of Higher Education in 2018 as an ‘Information and Communication Technology Officer’, Global Networks Technician/Admin Assistant, Certification TrainingHuawei Device and participated as a Presiding Officer in Elections"
  },
  {
    "name": "Ms. Binta Sanyang",
    "image": "/img/Ambassadors/Ms_ Binta Sanyang Gambia co devi.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Lecturer, Electrical Engineer, National Water and Electricity Company (Nawec), and a former Treasurer for International Student Community (ISC) at Islamic University of Technology, Bangladesh."
  },
  {
    "name": "Dr Diana Amoni",
    "image": "/img/Ambassadors/Dr_ Diana Amoni Ntewusu Ghana Ambasador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr Diana Amoni Ntewusu is a research scientist at CSIR – Science and Technology Policy Research Institute and a dedicated member of the Ghana ASTII team with a passion for driving innovation and excellence. She is a medical sociologist with a PhD from the University of Ghana, Legon. Her research focuses on the Sociology of Health, Illness, and Health Care; Health Services Administration; Development of Traditional Health Care Systems; Traditional Medicine and Sustainable Development; and the Impact of Regulatory Regimes on Traditional Medical Practices. She also has a strong background in STEM education with over 15 years of experience in mentorship and using collaborative approaches in the teaching and learning of STEM subjects in the Ghana Education Service. Dr Ntewusu is committed to nurturing, inspiring, and empowering the next generation of female STEM professionals and fostering a collaborative environment for continuous learning"
  },
  {
    "name": "Prof. Dr. Rania Lampou",
    "image": "/img/Ambassadors/Prof_ Dr_ Rania Lampou Greece Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Prof. dr. Rania Lampou is a multi-awarded global educator, STEM instructor, ICT teacher trainer, and researcher in cognitive neurosciences. Based in Greece, she works at the Greek Ministry of Education's Directorate of Educational Technology and Innovation, developing STEAM projects for schools. She also teaches STEM at the Greek Astronomy and Space Company. Rania has received over 200 national and international awards, including the \"Global Teacher Award\" (2019-2021) and was a \"Global Teacher Prize Finalist\" in 2019. Recognized globally, she has been featured as a \"Global Icon 2020\" and among the \"100 Most Successful Women in Business.\" Passionate about integrating STEM with diverse fields, she promotes projects aligned with the UN Sustainable Development Goals. Rania is a prolific author of children's scientific books and a leader in various global organizations, including the United Peace Keepers Federation and Women Economic Forum. She actively supports education, humanitarian efforts, and social activism, collaborating with institutions like Harvard University. A frequent speaker at international conferences, she has contributed extensively to academic journals. Rania's dedication to innovation and global education inspires educators and learners worldwide."
  },
  
  {
    "name": "Ms. Tamara Savoury",
    "image": "/img/Ambassadors/Ms_ Tamara Savoury Grenada Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Tamara Savoury is a Grenadian woman who has spent most of her life committed to volunteerism and advocacy in the Caribbean Region and beyond. She is the Chief Commissioner of The Girl Guides Association of Grenada and a floor member of The Grenada National Organisation of women; the empowerment of girls and young women is most of her advocacy. She has a Master of Arts in English Language and has taught children and young adults in Grenada, China and remotely. Tamara believes that advocating for the rights of human beings should be a collaborative effort which includes making all global citizens aware of their responsibilities in ensuring a good present and future for all."
  },
  {
    "name": "Ms. Katia Sofía Samayoa Artiga",
    "image": "/img/Ambassadors/Ms_ Katia Sofía Samayoa Artiga Guatemala Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Since childhood, she has dreamed of conquering the world and reaching infinity and beyond. She is a passionate science communicator, a winner of multiple science fairs, a dedicated student of Biotechnology Engineering, a member of the AGICE board of directors, a scientific director of the Microalgae project aimed at advancing the Sustainable Development Goals (SDGs), and a strong supporter of increasing women's participation in STEM fields."
  },
  {
    "name": "Ms. Sarah Foucauld",
    "image": "/img/Ambassadors/Ms_ Sarah Foucauld Haiti Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sarah Foucauld is a biologist, environmental scientist, FAA-licensed drone pilot, and sustainability expert with a strong academic background. She is currently continuing her education in Environmental Engineering. She applies her knowledge to support sustainability. Sarah is also the CEO of Eko Guide, which she places in the community to spread environmental awareness"
  },
  {
    "name": "Ms. Ana Thompson",
    "image": "/img/Ambassadors/Ms_ Ana Thompson Honduras Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Ana Thompson, an electrical engineer graduated from the National Autonomous University of Honduras. Currently participating in the Morazán Project as Payload Engineer, while also providing support for the data and energy subsystems, contributing to the development of the first Honduran satellite. Also in charge of the National Science and Technology Laboratory Center of Honduras, where initiatives are managed to promote scientific research and technological innovation in the country. The academic background includes a postgraduate specialization in Aerospace Systems and Industry from the University of Buenos Aires, and currently pursuing a master’s degree in Space Industry and Technology Management at the same university."
  },
  {
    "name": "Ms. Zsuzsanna Benyo",
    "image": "/img/Ambassadors/Ms_ Zsuzsanna Benyo Hungary Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Zsuzsanna is a visionary leader in the global space industry, driving innovation and collaboration toward a sustainable, multi-planetary future. As CEO of SpaceABC, she advances space exploration and paves the way for healthy longevity in space and beyond. With over a decade of experience in international space policy, business development, and research, Zsuzsanna has built partnerships with ESA, NASA, and other space agencies. She specializes in stakeholder engagement, advocacy, public relations, and governmental affairs. Her leadership has earned her recognition, including selection by the European Space Agency and first prize from the National Space Society. A seasoned speaker, Zsuzsanna has addressed audiences at major events like the International Astronautical Congress and the Space Economy Conference. Her contributions are further underscored by her PhD in Space Research and a master’s in Multidisciplinary Space Sciences and Business. She continues to drive innovation in the global space sector."
  },
  
  {
    "name": "Ms. Jaya Tare",
    "image": "/img/Ambassadors/Jaya Tare.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Wing Commander Jaya Tare (Retd) Pilot, Indian Airforce. 3500+ hrs of flying experience in various aircrafts. Qualified Aircraft Accident investigator, Top Corporate 'women enabler', guest speaker and life coach, Top women achiever for exceptional Aviation record  - WICCI, G100 leader for Space tech and Aviation wing."
  },
  {
    "name": "Ms. Mamonaheng Koenane",
    "image": "/img/Ambassadors/Ms_ Mamonaheng Koenane Ireland Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Founder at Impact School, Founder at Holberton School Lesotho, Board Director, Diversein Women Breakin The Bias Zozz, WWC \"Technologist To Watch\" and Board Member of Revenue Services Lesotho."
  },
  {
    "name": "Ms. Nicole Zinna",
    "image": "/img/Ambassadors/Ms_ Nicole Zinna Italy Ambassador - Mission ShathiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Nicole Zinna is a Bachelor's degree student in aerospace engineering at the University of Naples Federico II, with a strong background in aeronautical technical assistance and structural engineering. She is actively involved in experimental rocketry with UniNa Rockets, contributing to the design and analysis of rocket components for the European Rocketry Challenge. Her certifications include training in space medicine, safety protocols, and advanced engineering software like CATIA and MATLAB. Nicole is also skilled in public speaking, teamwork, and multilingual communication, with proficiency in English, Spanish, and basic Chinese."
  },
  {
    "name": "Ms. Dominique Campbell",
    "image": "/img/Ambassadors/Ms_ Dominique Campbell Jamaica Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dominique Campbell is an astronomy and space enthusiast. She has a BSc in Physics from University of the West Indies. She started her journey in undergrad by being an active member of the Astronomical Association of Jamaica which opened up the opportunity to serve as the National point of Contact for Jamaica under the Space Generation Advisory Council (SGAC). She is now the PR and Communications manager for the NCAC region under the SGAC and is the Jamaican chapter Representative of the Caribbean Space Society."
  },
  {
    "name": "Ms. Lana Abukhader",
    "image": "/img/Ambassadors/Ms_ Lana Abukhader Jordan Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Lana Abukhader is an experienced Class Dean and Science Teacher at King's Academy in Jordan, with over seven years of expertise in education and dance. She holds a Bachelor of Science in Pharmacy from the University of Jordan, a Master's in Education from the University of Reading, and an International Postgraduate Certificate in Education from the University of Sheffield. Alongside her academic roles, Lana is a talented freelance choreographer and performer, having worked on various projects since 2012. In her role as Class Dean, she supports and mentors 100 students, overseeing their academic and personal growth. As a Science Teacher, she delivers dynamic and interactive lessons, integrating innovative teaching methods and technology. Passionate about extracurricular activities, Lana shares her love for dance and music with both students and staff. She is dedicated to fostering an inclusive, collaborative environment where students can thrive and believes in the transformative power of education and the arts."
  },
  {
    "name": "Ms. Olyvia Gatwiri",
    "image": "/img/Ambassadors/Ms_ Olyvia Gatwiri Aerospace Engineer.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Aerospace Engineer, science communicator Astronomy and Space Science Outreach Officer"
  },
  {
    "name": "Ms. Saltanat Mambetisaeva",
    "image": "/img/Ambassadors/Ms_ Saltanat Mambetisaeva Kyrgyzstan -  Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Saltanat Mambetisaeva has spent nearly two decades advancing youth education and development in Kyrgyzstan. As director of the NGO “Youth Hope,” she led initiatives that improved socio-economic conditions in rural areas, supported more than 300 young people, reduced bride kidnapping through awareness theatre, and helped schools gain essential water access. Passionate about cultural exchange, she promoted diversity through dance and training programs that deeply impacted village students. With a Bachelor’s degree in Informatics, she later worked in an international school, developing computer science materials and training teachers. Since 2018, she has championed Kyrgyzstan’s participation in the FIRST Global Challenge, mentoring robotics teams and expanding STEM opportunities. Saltanat’s dedication to youth empowerment and education has earned her recognition as a leading advocate for positive change in her community."
  },
  {
    "name": "Ms. Samanta Kelmere",
    "image": "/img/Ambassadors/Ms_ Samanta Kelmere Latvia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Samanta is a passionate Physics and Mathematics student with a bold ambition to become a rocket scientist. Fascinated by satellites and rockets, she has already made strides in the field—attending the European Space Camp, designing and launching a payload, and successfully deploying a balloon that reached the stratosphere. With a relentless drive for exploration and innovation, she is on a trajectory to shape the future of space technology. 🚀✨"
  },
  {
    "name": "Ms. Puseletso Thubela",
    "image": "/img/Ambassadors/Ms_ Puseletso Thubela Lesotho Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Puseletso Thubela, Assistant Research Officer at the Department of Science, Technology, and Innovation (DSTI) in Lesotho, promotes scientific research and technological advancement. As the focal person for the African Science, Technology, and Innovation Indicators (ASTII) initiative, she assesses the impact of science and technology policies in Africa. Her work supports evidence-based policymaking and fosters innovation. Additionally, she contributed to drafting Lesotho's National Intellectual Property Policy and Strategy, enhancing the national IP landscape."
  },
  {
    "name": "Ms. Mathele Mpiko",
    "image": "/img/Ambassadors/Ms_ Mathele Mpiko Lesotho Tech-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Tech-Ambassador",
    "about": "Mathele Mpiko is a passionate space technologist and software developer with expertise in various programming languages. Currently, she contributes to the Phakoe CubeSat team, advancing small satellite technology for climate monitoring in Lesotho. With a background in IT support, data management, and space research, Ms. Mpiko creates impactful solutions that bridge innovation and real-world challenges."
  },
  {
    "name": "Ms. Welleh Joy Won",
    "image": "/img/Ambassadors/Ms_ Welleh Joy Won Liberia Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Welleh Joy Won is a dedicated Liberian professional with a strong passion for youth empowerment and community development. She holds a Bachelor’s degree in Information Technology from Starz University and a Leadership Certificate from the Young African Leadership Development Institute (YALDI). Her diverse experience includes roles as Chief Financial Officer at Passion for Youth Education Foundation, Computer Technician at Liberia National Election Commission Voter's Registration Center, and Systems Administrator at QE24 Group of Companies."
  },
  {
    "name": "Ms. Deena Cooper-Morgan",
    "image": "/img/Ambassadors/Ms_ Deena Cooper-Morgan Liberia Co-Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Deena Cooper-Morgan is the Resident Engineer at Liberia's Ministry of Public Works, with over 12 years of experience in civil engineering, construction, and project management. She has spearheaded major road construction projects, significantly contributing to Liberia’s infrastructure development. Since 2015, Deena has supervised the Reconstruction of Somalia Drive, a transformative project expanding a two-lane urban road to four lanes, building two bridges at Stockton Creek, and improving drainage systems, with completion slated for 2021. As Vice President of the Society of Women Engineers of Liberia (SWEL), Deena champions women in STEM, organizing training programs, networking events, and outreach initiatives to inspire and empower young women pursuing engineering careers. Her career includes roles at Total Liberia Inc. and Firestone Plantations Company, alongside consultancy for projects like Premier Milling Corporation’s wheat factory. A civil engineering graduate from Stella Maris Polytechnic and member of ESOL, Deena is married with one son."
  },
  {
    "name": "Ms.  Alexandra Tsyliya",
    "image": "/img/Ambassadors/Luxembourg.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Accomplished expert in strategic communications with a focus on brand awareness campaigns. ICF-certified coach passionate about the creative industries and the tech world. Currently working in the dynamic fintech startup ‘Alokta’. Creator of 'Lux Brunches,' a series of women empowerment events in Luxembourg, and 'My Brand Crisis,' a motivational video guide featuring compelling stories of strong and fascinating personalities."
  },
  {
    "name": "Ms. Martina Dimoska",
    "image": "/img/Ambassadors/bd774b_83d37e0ab9bb4aaaa39a0bb33778fb01~mv2.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Awarded Published Research Scholar, Engineer, Pioneering Figure in Space Exploration, Analog Astronaut, Google Woman Techmaker Ambassador, TEDx Speaker, Recipient of Numberous Awards, Including Forbes 30 under 30 Nomination Europe, And Woman or Scientist of the year of Plethora of Times."
  },
  {
    "name": "Ms. Miora Randrianasy",
    "image": "/img/Ambassadors/Ms_ Miora Randrianasy Madagaskar Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "MSc student in Astrophysics and Astronomy at the University of Antananarivo and Computer Science student at the MISA, I am comitted to empowering women in science and promoting STEM education. I am thrilled about the chance to encourage girls to seek professions in technology and space by serving as an ambassador for Mission ShakthiSAT on behalf of Madagascar."
  },
  {
    "name": "Ms. Kumbutso Takomana",
    "image": "/img/Ambassadors/Ms_ Kumbutso Takomana Malawi Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Quality Assurance Systems Expert- Manufacturing Processes & Certification, Lean Six Sigma Practitioner, Entrepreneur, Business Development Mentor & Coach – Women Creating Wealth & Start Your Social Enterprise Programs, Founder AICHI Company Limited & Quality Experts Consultants, Top 8 2021 Standard Bank Malawi Woman on Rise Masterclass Series, Board Member- Limbe Leaf SACCO, Quality Control Manager Limbe Leaf Tobacco Company"
  },
  {
    "name": "Ms. Tamandah Kandodo",
    "image": "/img/Ambassadors/Ms_ Tamandah Kandodo Malawi coD.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Tamandah Lucia Kandodo is a passionate advocate for women in technology with a strong background in Computing Information Systems and expertise in web development and software engineering. She has been instrumental in mentoring young women to pursue STEM careers and has worked on innovative projects, including a rural electrification management system and a digital smart queue system, aimed at improving user experiences and solving real-world problems. Committed to fostering inclusivity and breaking barriers for women in tech, Tamandah is deeply involved in initiatives that promote STEM education for girls. She is dedicated to creating opportunities and providing resources to help young women excel in the tech industry, serving as a mentor and role model. Driven by the belief that diversity drives innovation, Tamandah continues to inspire more girls to embrace STEM careers and make a lasting impact on the technology industry."
  },
  {
    "name": "Amb. Prof. Dr. Esther Mala",
    "image": "/img/Ambassadors/Amb_ Prof_ Dr_ Esther Mala Malaysia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Researcher, International Speaker, business leader and outstanding entrepreneur, Academician, Soft Skill Trainer, SDG & Tech Enthusiast, Startup Mentor, Founder President of Elegant Empire Education in Malaysia, Ambassador for Commonwealth Iconic Federation for Malaysia, CEO of Elite Media Services, Education Ambassador Calligirlsbooks - USA, International Multi-award winner, honored with World's Phenomenal and Transformational Leader award and multiple other awards."
  },
  {
    "name": "Dr. Anu R I",
    "image": "/img/Ambassadors/Dr_ Anu R I Malta Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassdor",
    "about": "Dr. Anu R. I is a dedicated researcher specializing in precision oncology and spaceflight omics, with a strong focus on translational cancer research. Her work at the University of Malta and current role as a Precision Oncology Scientific Expert at Guardant Health place her at the forefront of radiogenomics and DNA damage repair. She has pioneered automatic foci quantification methodologies to enhance the understanding of radiation-induced genomic alterations. Her expertise extends to multi-omics and systems biology, collaborating with NASA scientists as a member of the ALSDA and AI/ML Working Groups. She contributes to multiomic data analysis, ethical regulations, and innovative treatment strategies, bridging oncology and space science. With a passion for interdisciplinary collaboration, Dr. Anu works with global research teams to unravel the complexities of molecular oncology and translate findings into real-world clinical applications. Her research paves the way for personalized cancer therapies, leveraging advanced bioinformatics and AI-driven solutions to improve patient outcomes and deepen our understanding of genomic stability in space and terrestrial environments."
  },
  {
    "name": "Ms. Dafne Pimentel",
    "image": "/img/Ambassadors/Ms_ Dafne Pimentel  Mexico Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Mexican Woman Astronaut Candidate - Undergraduate Student in Robotics Engineering - Pilot in training - International Speaker - World Space Week Monterrey Director in 2023 and STEAM mentor at the first aerospace camp in Latin America."
  },
  {
    "name": "Ms. Steliana Burlacu",
    "image": "/img/Ambassadors/Ms_ Steliana Burlacu Moldova Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Ms. Steliana Burlacu is a CSO expert, capacity-building trainer and head of the Foundation for Education and Development – Moldova (FED Moldova). She has Experience in working for a sustainably developed society through program/project management, delivering training, and conducting research within the non-profit sector, international organizations (Humanity’s Team Worldwide, Soros Foundation, UNDP, EU TACIS, OSCE/ODIHR, USAID Project), and public sector. SHE IS Licensed in Humanitarian Sciences, has a Master's in Public Administration (National School of Political and Administrative Studies, Bucharest, Romania), a Diploma in International Civil Service (IRIC, Yaoundé/ IIAP, Paris / UNITAR, Geneva), internships at Council of Europe (Strasbourg, France), UN ILO (Geneva, Switzerland), Czech Fundraising Centre under Prague Civil Society Centre."
  },
  {
    "name": "Dr. Anna Talgat",
    "image": "/img/Ambassadors/Dr_ Anna Talgat Mangolia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Anna Talgat is a researcher specializing in applied mathematics and computational sciences, with a focus on stochastic geometry and satellite communications. She earned her Bachelor of Science in Mathematics from Istanbul (previous name Fatih) University in Istanbul, Turkey, in 2015, and her Master of Science in Applied Mathematics and Computational Sciences from King Abdullah University of Science and Technology (KAUST) in Thuwal, Saudi Arabia, in 2020. Dr. Talgat completed her Ph.D. in Applied Mathematics and Computational Sciences at KAUST in 2024. During her doctoral studies, Dr. Talgat's research focused on applying stochastic geometry to satellite communication systems, particularly Low Earth Orbit (LEO) satellites. Her work aimed to enhance the efficiency and reliability of wireless communications, with applications in Internet of Things (IoT) networks and secure data transmission in space communications. In 2024, Dr. Talgat, along with her colleagues Dr. Mustafa Kishk and Professor Mohamed-Slim Alouini, received an Honorable Mention in the IEEE Connecting the Unconnected (CTU) Challenge for their project titled \"Enhanced IoT Connectivity in Underserved Areas Using LEO Satellite Networks.\" This project leverages LEO satellite networks to provide reliable and affordable IoT connectivity to rural and underserved communities, addressing challenges such as uplink performance, energy sustainability, and data security. Her work has been cited extensively, reflecting her significant contributions to the field. Dr. Talgat's dedication to advancing satellite communication technologies underscores her commitment to bridging the digital divide and enhancing global connectivity."
  },
  {
    "name": "Ms. Nina Drakulic",
    "image": "/img/Ambassadors/Ms_ Nina Drakulic Montenegro Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "As a founder of Montenegro Robotics, a non-governmental organization that promotes scientific and technological leadership and innovation among young people in Montenegro, I am passionate about inspiring and empowering the next generation of STEM professionals. I have initiated and organized several projects, such as Arduino and 3D printing courses, robotics workshops, world robotics competitions, eco-robots, and summer schools of modern technology. I have also established partnerships with local and international institutions, sponsors, and media to support and expand our mission and vision."
  },
  {
    "name": "Ms. Izza Rym",
    "image": "/img/Ambassadors/Ms_ Izza Rym Moracco Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Moroccan and passionate advocate for education, With a deep love for stargazing and the mysteries of space, I am thrilled to be part of a mission that not only opens the doors to education but also aims to send a rocket to orbit the moon. I am committed to raising awareness and support in Morocco for this incredible cause, helping young girls dream big and reach for the stars."
  },
  {
    "name": "Ms. Rachida Aligy Ussen Mamade",
    "image": "/img/Ambassadors/Mozambique.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Deputy National Director for Planning Statistic and Cooperation. Member of the Board of the National Authority for Professional Education (ANEP), Member of the Board of Rovuma University, Steering Committee Member of Mozskills - World Bank Project, Member of the Support Committee for the Permanent Mission of Mozambique in New York and Member of the United Nations Ad Hoc Committee for the Elaboration of the International Convention against the Use of Information and Communication Technologies for Criminal Purposes."
  },
  {
    "name": "Ms. Odete Frederico Xavier Namuera",
    "image": "/img/Ambassadors/Ms_  Odete Frederico Xavier Namuera Mozambique Ambassador.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Civil servant linked to the Ministry of Science, Technology and Higher Education of Mozambique, current category Assistant Researcher, in the National Directorate of Science, Technology and Innovation, UN Women focal point for the African Girls Can Code initiative; Focal point for the CPLP network of scientific journals on Women and Girls in Science; Focal point for the Horizon Europe Program; Focal point for the inventories program in the area of ​​Climate Change in Ministry of Lands and Environment"
  },
  {
    "name": "Ms. Sónia Cintura",
    "image": "/img/Ambassadors/Ms_  Sónia Cintura Ambassador Mozambique.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Head of the Cooperation Department at the Ministry of Science, Technology and Higher Education, civil servant at the Ministry of Science, Technology and Higher Education, held different leadership and trust positions, such as Chief of Staff of the Minister, Provincial Delegate for Science and Technology of Manica, Head of Thematic Research Department, HIV and AIDS Focal Point, Public Relations Assistant, and Gender Focal Point."
  },
  {
    "name": "Hon. Ms. Pwint Mar Han",
    "image": "/img/Ambassadors/Hon_ Ms_ Pwint Mar Han Myanmar Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Pwint Mar Han is Honorary Consul of Sweden in Myanmar, distinguished business leader, educator, and diplomat with extensive experience in project management, international relations, and strategic development. She holds an Executive MBA from the Yangon Institute of Economics and a B.Bus in Finance and IT from the University of Technology, Sydney. Currently, she serves as Program Director at Device Business University and Lecturer at Business Institute Yangon, overseeing academic structures, marketing strategies, and faculty operations. Since 2017, she has been the Honorary Consul of Sweden in Myanmar, strengthening diplomatic relations and assisting Swedish citizens. Her career spans industries such as aviation, steel, foreign direct investment, and marketing, having held leadership roles in Air Bagan, Myanmar Steel Association, and Focus Marketing & Distribution."
  },
  {
    "name": "Dr. Smita Francis",
    "image": "/img/Ambassadors/Dr_ Smita Francis Namibia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Smita Francis, Director of the Namibia Institute of Space Technology (NIST) at Namibia University of Science and Technology (NUST), drives innovation in space technology and satellite communication. She is a key member of Namibia's National Space Advisory Committee, working to establish a nanosatellite ground station and build global partnerships. As part of the African Millimetre Telescope Technical Committee, she contributes to enhancing Africa’s presence in global astronomy. She initiated Namibia Space Week to spark public interest in space science and its role in sustainable development. Her accolades include the Mastercard Women SME Leaders Award 2024 (Social Impact Leader), the World Federation of Engineering Organisations President’s Award (2019), and leadership honours from African and global organisations. Passionate about leveraging space technology for challenges like precision farming and resource management, Dr. Francis mentors future space scientists, positioning Namibia as a leader in space innovation and sustainability."
  },
  {
    "name": "Ms. Ira Sharma",
    "image": "/img/Ambassadors/Ms_ Ira Sharma Nepal Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Incoming undergraduate student in Aerospace and Mechanical Engineering, Skilled in the fields of Research, Writing, Communication, Art, Project Management, and Film Making, and currently involved at Antarikchya Pratisthan Nepal (Space Foundation Nepal) as a Junior Satellite Research Fellow and Also involved in training programs all around Nepal to train students of Grade 6 up to undergraduate on STEM Topics."
  },
  {
    "name": "Ms. Pragya JaIn",
    "image": "/img/Ambassadors/Ms_ Pragya Jain Netherlands Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "As a transdisciplinary researcher, Pragya Jain’s work centres around the convergence of scientific inquiry and artistic exploration. Situated at this intersection, her research takes form in embodied data exploration models and interactive installations, achieved by employing and superimposing scientific insights, cultural knowledges, and artistic methodologies, seeking to explore their potential points of intersection that often remain invisible. One of her collaborations with ESA involves an experiential interactive audio-visual installation, enabling multisensorial exploration with Gaia mission data. In 2024, she was invited to contribute as an artist-in-residence at the Het Nieuwe Instituut, the national museum of architecture, design and digital culture in the Netherlands. Where she expanded on her research of astronomy, data sonification, and human-data interaction for gravitational wave data analysis and the paradigm of cultural astronomy. Currently, she is contributing towards the AI and Embodiment project as a research assistant at Leiden University, an initiative exploring the gap between embodied cognition and generative AI. She is also participating in International Space University's Space Studies Program 2025."
  },
  {
    "name": "Ms. Jess Covich",
    "image": "/img/Ambassadors/Ms_ Jess Covich New Zealand Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Jess Covich has an established presence in the New Zealand Space industry as CEO and founder of Space Trailblazer. Her collaborative spirit and innovative thinking have propelled numerous projects, fostering significant advancements in bringing the commercial space industry together and commercialising industry partnerships. Jess’s expertise in business development, coupled with her commitment to seeing NZ’s space sector thrive, has made her a key figure in NZ’s aerospace ecosystem. Her dedication and ability to bring together diverse groups and drive forward-thinking solutions highlights her exceptional role in shaping the exciting future of the space economy for the NZ Space Agency"
  },
  {
    "name": "Ms. Felicia Oluwatoyin Ajayi",
    "image": "/img/Ambassadors/Ms_ Felicia Oluwatoyin Ajayi  Nigeria Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Felicia Oluwatoyin Ajayi is the Assistant Director at the African Regional Centre for Space Science and Technology Education in English (UN-ARCSSTEE). She leads the Disaster and Emergency Management Unit within the Space Application Division. Since joining the Centre in 2005 as a Scientific Officer, she has been instrumental in advancing space education outreach across Africa through the Space Education Outreach Programme (SEOP). Her work includes organizing STEM initiatives such as thematic space presentations, hands-on projects, microgravity experiments, debates, and quiz competitions. Felicia holds a B.Sc. in Computer Science from the University of Ilorin (2002), an M.Sc. in Special Education and Curriculum Studies from Obafemi Awolowo University (2011), and an M.Sc. in Remote Sensing and GIS (2018). She is currently pursuing her Ph.D. at Obafemi Awolowo University, Ile-Ife, Nigeria, focusing on space applications for disaster management."
  },
  {
    "name": "Ms. Uroi N Salii",
    "image": "/img/Ambassadors/Ms_ Uroi N Salii Palau Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Uroi N. Salii is a dedicate leader and advocate for the empowerment of Palauan girls and women. She currently serves as the Deputy-Secretary General at the Austronesian Forum Organization where she brings the Austronesian communities of the Pacific region together to promote cultural sustainability, language and cultural exchanges, regional industry development, academic and policy research, and youth and women empowerment amongst the Austronesian peoples. Uroi has extensive experience in leadership as being a member of Mechesil Belau (Palauan Traditional Leader Women’s Group) to the Republic of Palau National Coordinating Mechanism, Traditional dance and chant instructor, and was a board and vice chairman of the Financial Institution Board of the Republic of Palau. Her academic credentials include a Global Master’s in Business Administration from National Taiwan University and a Bachelor of Science in business administration from the University of Denver. Beyond her professional roles, Uroi is deeply connected to her cultural heritage and her role as a Palauan woman in her society and is also a Palau national athlete in Va’a (Outrigger canoeing), she represents the values of resilience, tradition, and adaptability in all aspects of her life."
  },
  {
    "name": "Dr. María Heller",
    "image": "/img/Ambassadors/Dr_ María Heller Panama Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "A team from the National Secretariat of Science, Technology and Innovation (SENACYT), led by María Heller, represents Panama as ambassador. With over 10 years as Director of Innovation in Science and Technology Learning at SENACYT, María has led national projects to strengthen science education, including large-scale student assessments, science teaching materials, and teacher training programs. She has also promoted science and technology outreach to inspire children and youth. María holds a degree in Biochemistry and a Ph.D. in Immunology from the University of Buenos Aires and has contributed as a consultant and researcher in various scientific projects."
  },
  {
    "name": "Ms. Loretta Tunim",
    "image": "/img/Ambassadors/Ms_ Loretta Tunim Papau New Guinea Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Loretta Tunim is a dedicated advocate for gender inclusion and sustainable development, with a rich background in media, education, business operations, and international development. As a Former National Consultant for the World Bank Education Team and the National Education Department, she has driven impactful initiatives in Papua New Guinea (PNG). Loretta supports women-owned small businesses, fostering growth and resilience, and has excelled in roles spanning journalism, project coordination, and sustainability. Currently a Sustainability Strategist at Vinci Construction, she oversees the PNG LNG project, ensuring sustainable practices. Loretta is an active member of PNG Women in Construction, championing empowerment and accessibility."
  },
  
  {
    "name": "Ms. Hebe Luisa Romero Talavera",
    "image": "/img/Ambassadors/Ms_ Hebe Luisa Romero Talavera Paraguay Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Hebe Romero graduated with a Law degree from the Universidad Nacional de Asunción (1997) and later obtained a Public Notary certification (2000). She pursued further studies in Higher Education Didactics and is completing her PhD in Legal Sciences at the Universidad Católica de Asunción. Hebe earned her LLC in Public Administration (2012) and completed the Aerospace Strategy and Policy program (2013). Since 2002, she has been a tenured professor at the Universidad Nacional de Asunción, teaching Aeronautical, Space, and Public International Law. Her professional career began in 1997 as an attorney and, in 1998, she joined ANDE, Paraguay's national electricity utility, where she became Director of Legal Affairs in 2010. An expert in aerospace law, she joined the Ibero-American Institute of Aeronautical Law and Space in 2015 and coauthored Paraguay's first book on space law (2017). She served as General Secretary of Paraguay’s Aerospace Research Center from 2016 to 2023 and has been the General Director of Legal and International Affairs for the Paraguayan Space Agency since 2017. Hebe is a recognized authority in space law, serving as an arbitrator for disputes related to outer space activities from 2018 to 2024. She has coauthored legal works, lectured internationally, and coordinated educational initiatives, including Paraguay’s first regional space art competition."
  },
  {
    "name": "Ms. Sofia Bouby",
    "image": "/img/Ambassadors/Ms_ Sofia Bouby  Peru Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sofia Bouby holds a bachelor's degree in Telecommunications Engineering with expertise in virtualization, cloud computing, networking, and security, supported by certifications in Azure, AWS, and Citrix. As the founding president of the IEEE Aerospace and Electronic Systems Society chapter at her university in Peru, Sofia led initiatives to advance aerospace sciences, including the International Congress of Astronautics and Space Exploration. Under her leadership, the chapter was recognized as an Exemplary Student Chapter in 2022. In 2023, she served as a judge for the NASA Space Apps Challenge Campeche, evaluating projects that tackled global challenges with space technologies. Sofia is passionate about technological innovation and dedicated to fostering a vibrant, informed community in aerospace and telecommunications."
  },
  {
    "name": "Ms. Nicfreida Marie Guadalupe M. Gomez",
    "image": "/img/Ambassadors/Ms_ Nicfreida Marie Guadalupe M_ Gomez Phillipines.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Nicfreida Marie Guadalupe M. Gomez, also known as \"Nikki,\" is the team captain of Lawin PH, recognized as a Global Nominee in the NASA International Space Apps Challenge 2020 for developing \"Lawin,\" an app providing students with NASA Earth datasets. She is an astrophysicist in training and is passionate about science communication. Nikki volunteers with WiTech Manila, an organization empowering youth to break gender stereotypes in STEM. She also creates science content to inspire and advocate for women in space science. Additionally, she served as Head of Fundraising for SEDSPh (Students for the Exploration and Development of Space in the Philippines), promoting student involvement in the space industry. Recently, Nikki was one of the youngest STEM leaders representing the Philippines at a leadership event hosted in Singapore by Asian Scientist magazine, which honors contributions to science and technology across Asia."
  },
  {
    "name": "Eng. Agnieszka Elwertowska",
    "image": "/img/Ambassadors/Eng_ Agnieszka Elwertowska Ambassador Poland.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Engineer, Researcher, chapter Director Global STEM Initiative - Chapter of Poland, Analog Astronaut interested and having substantial experience in aerospace engineering, electronics, programming and prototyping of machines, robots, Focused on organizing and participating in analog space missions & astronaut training and a TEDx Speaker"
  },
  {
    "name": "Ms. Rita Liliana Dias Barbosa",
    "image": "/img/Ambassadors/Ms_ Rita Liliana Dias Barbosa Portugal Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Seasoned engineer with over 20 years of experience, currently focused on energy efficiency at the largest electrical company in Portugal. Expertise in utilizing space technologies to optimize energy solutions, and committed to promoting sustainable practices in the field of engineering."
  },
  {
    "name": "Ms. Cailin Rugema",
    "image": "/img/Ambassadors/Ms_ Cailin Rugema Rwanda Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "ScientisCailin Rugema is an international student from East Africa currently studying under the Cambridge system, with a focus on IGCSE and A-Levels. As a rising junior, Cailin is passionate about STEM, particularly in the fields of engineering and environmental science. Dedicated to addressing global challenges, Cailin aspires to develop innovative and sustainable solutions through a blend of technical expertise and environmental awareness.t"
  },
  {
    "name": "Ms. Jasmine Koria",
    "image": "/img/Ambassadors/Ms_ Jasmine Koria Samoa Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Jasmine Koria is an educator, artist, international representative and Commonwealth Scholar from the Independent State of Samoa. She has over a decade of experience in youth work, and has a great passion for utilizing education to address global equity issues and improve international relations. She holds a B.A in International Relations, Political Science and English Literature from the Victoria University of Wellington, New Zealand, a Certificate IV in Adult Teaching from the National University of Samoa, and is pursuing an M.A in Online Teaching at the U.K's Open University."
  },
  {
    "name": "Ms. Nora Almohizai",
    "image": "/img/Ambassadors/Ms_ Nora Almohizai Saudi Arabia Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Nora Almohizai is a physicist with honors from King Saud University, known for her leadership, innovation, and passion for space exploration. As former Country Manager for KSA at Starlight Education Group, she led training development and business growth initiatives. Trained by Dale Carnegie and GOOSTA, she brings strong team-building and communication skills. An Astrophile Ambassador, Nora is dedicated to inspiring curiosity about the universe and advancing space science. She sees herself as an adventurer—constantly seeking new challenges and opportunities for growth, both personally and professionally, while making a meaningful impact in the global scientific community."
  },
  {
    "name": "Ms. Seynabou Diouf",
    "image": "/img/Ambassadors/Ms_ Seynabou Diouf Senegal Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "My name is Seynabou Diouf, and I'm a young Senegalese woman with a passion for space science. After passing my baccalaureate at the Lycée de Ndoffane , I went on to study at the Université du Sine Saloum, where I obtained a degree in Geomatics and Climatology. I'm currently pursuing a Master's degree in Geomatics, with a particular interest in the development of the space sector. My career path is guided by my determination to contribute to the progress of this strategic discipline. As a committed woman, I also fight to promote the place of women in science and technology, inspiring and supporting young girls to embrace these promising fields."
  },
  {
    "name": "Dr Monika Jurkovic",
    "image": "/img/Ambassadors/Dr_ Monika I_ Jurkovic Serbia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Monika I. Jurkovic is an esteemed astronomer at the Astronomical Observatory in Belgrade, where she has worked since 2011. Dr. Jurkovic is the National Outreach Coordinator (NOC) for Serbia of the International Astronomical Union until 2024. her research focuses on pulsating stars, particularly Type II and anomalous Cepheids. She developed the first period-luminosity relation based on direct luminosity measurements, which is crucial for determining distances to stars beyond the Milky Way. With 18 published articles and an h-index of 6, her work has been cited 117 times. She has participated in key projects, including the Ministry of Education’s “Stellar Physics” and the HORIZON 2022 project, COSMOS4HE. Dr. Jurkovic has received multiple awards, including the “Best Young Researcher” in 2020. An active science communicator, she was a finalist in the “FameLab” competition in 2011 and has appeared on various media platforms. She serves as the National Outreach Coordinator for the International Astronomical Union for Serbia and is the President of the Society of Astronomers of Serbia."
  },
  {
    "name": "Ms. Nichola Abrams",
    "image": "/img/Ambassadors/Ms_ Nichola Abrahms Sychelles.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Founder of The Hyperwave App, President of the Seychelles Ladies Circle (2022-2024), board member of the Seychelles Centre for Innovation and Sustainable Development (SCISD), Corporate Sales Manager at Intelvision Limited in Seychelles."
  },
  {
    "name": "Ms. Aminata Matturie",
    "image": "/img/Ambassadors/Ms_ Aminata Matturie Sierra Leone Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Scientist"
  },
  {
    "name": "Ms. Diana Fernandes",
    "image": "/img/Ambassadors/Dr_ Diana Amoni Ntewusu Ghana Ambasador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Madam Aminata Matturie is an activist, educator, and social worker with extensive experience advocating for marginalized women and children in Sierra Leone. She has held roles such as Constituency Secretary (2017-2018) and National Secretary for the Women in Governance Network (2020-2023). Currently, she serves on advisory boards for women-led networks. Committed to educational excellence, she inspires mentees to reach their potential and uplift communities. Madam Matturie empowers women to combat gender-based violence, advocate for economic rights, and participate in leadership. She also focuses on youth livelihood opportunities, natural resource management, and climate change advocacy for sustainable development."
  },
    {
    "name": "Ms. Vanja Angjelovikj",
    "image": "/img/Ambassadors/Ms_ Vanja Angjelovikj Slovenia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Vanja Angjelovikj is a 22-year-old materials engineer from North Macedonia, currently residing in Slovenia. She holds a bachelor's degree in Materials Engineering from the University of Ljubljana and will begin her master's studies there in October. Vanja's academic journey includes conducting experiments for her bachelor thesis at the Polytechnic University of Catalonia through the Erasmus+ program. She has professional experience as a Quality Control Engineer at Elaphe Propulsion and as a Graduate Research Assistant at the Institute Jozef Stefan, focusing on nanostructured materials. Passionate about Space Engineering, Vanja is eager to contribute to this exciting field"
  },
  {
    "name": "Ms. Nasiphi Ngcoliso",
    "image": "/img/Ambassadors/Ms_ Nasiphi Ngcoliso South Africa - Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Nasiphi Ngcoliso is a Junior Remote Sensing Scientist at the South African National Space Agency (SANSA), specializing in Earth Observation research and applications. She began her journey with SANSA as a Science Engagement intern through the DSI-HSRC internship program, where she introduced students aged 10-18 to space science, technology, and STEM careers. Nasiphi also served as a teaching assistant at the University of Pretoria, where she completed her master’s degree. Her work at SANSA’s Earth Observation division has included contributing to projects such as the Chris Hani District disaster atlas, the Capricorn District grazing capacity project, and the Eastern Cape deforestation analysis. Through this work, she has developed expertise in remote sensing, geospatial analysis, satellite data acquisition, and machine learning applications. Nasiphi combines technical proficiency, public awareness, and learner engagement with project management skills and is committed to advancing Space Science and Technology’s impact in South Africa and beyond."
  },
  {
    "name": "Ms. Rocío García",
    "image": "/img/Ambassadors/Ms_ Rocío García Spain Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Rocio Caparrós del Moral is a renowned expert in outer space governance and public affairs. Currently serving as head of institutional relations in Andalucía and national responsible for public affairs on space issues. A law graduate from the university of Jaén, she pursued PHD studies on European integration, focusing on legal and economic aspects, and specialises in the policies and legal framework of outer space. Her career highlights include roles at ESA´s european centre for space law, as well as positions at UNESCO COMEST, The international Astronautical Federation(IAF) and AIRBUS political affairs office. Rocio is committed with the promotion of gender equality and the empowerment of women and girls in the space sector and science. In 2023, she was selected by UNOOSA for the Space4Women program."
  },
  {
    "name": "Ms. Joy Karunya Mahendiran",
    "image": "/img/Ambassadors/Ms_ Joy Karunya Mahendiran Srilanka.jpg",
    "ambassadorRole": "Ambassador",
    "about": "ScientiJoy Karunya Mahendiran is currently serving as a temporary Assistant Lecturer at the University of Jaffna, Sri Lanka. With a BSc in Physics, graduating with First Class Honours, Joy has made significant contributions to both teaching and research. She has been recognized with multiple awards for her outstanding academic and research achievements, including the Best Oral Presentation Award at AMCEHA 2023. In addition to her academic pursuits, Joy is an accomplished athlete, having represented her university in various sports"
  },
  {
    "name": "Ms. Anya James",
    "image": "/img/Ambassadors/Ms_ Anya James St Lucia Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Anya James was born in the rural community of Mon Repos Micoud, in the beautiful Caribbean island of Saint Lucia. She is currently the Curriculum Officer for Natural Sciences in her home country. Before this, she was an educator for over 15 years teaching secondary school students physics and mathematics. She is very passionate about STEM and STEM Education which is reflected in her academic background. She holds a BSc in Electronics Engineering Technology and a Master of Science in Mathematics Education. She is very excited to be a part of the global ShakthiSAT Community."
  },
  {
    "name": "Ms. Sémonique K Harry",
    "image": "/img/Ambassadors/Ms_ Sémonique K Harry St vincent and the grenadines Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Sémonique K Harry is a seasoned educator with over 20 years of experience, holding a B.Ed. from the University of the West Indies and an MSc. in K-12 Integrating Technology in Education from Walden University. She has trained around 1,100 educators across the Caribbean in using digital tools to enhance both in-person and online learning. Ms. Harry manages an online educational repository and develops game-based learning content to support student engagement. A doctoral candidate, her research focuses on gamification and Open Educational Resources (OER). Additionally, she holds micro-credentials in working with students with autism and dyslexia, ESL teaching, and gamification. Ms. Harry is a master facilitator with UNESCO/Blackboard Academy and a member of Kappa Delta Pi and Golden Key International Honor Societies."
  },
  {
    "name": "Ms. Kenesha Foster",
    "image": "/img/Ambassadors/Ms_ Kenesha Foster from St_ Kitts and Nevis Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Kenesha Foster, a passionate education professional whose journey began in the islands of St. Vincent and the Grenadines. Now based in and representing St. Kitts and Nevis, she serves as a Curriculum Officer for Science, drawing from her experiences as a Physics and Integrated Science teacher, as well as her leadership role as the Head of the Sciences Department. Kenesha's journey also includes teaching Mathematics in her home country, St. Vincent. With a BSc in Physics and a Master's in Educational Leadership and Management, she is dedicated to fostering a love for science and empowering the next generation of learners."
  },
  {
    "name": "Dr. Asinta Ntinda Manyele",
    "image": "/img/Ambassadors/Dr_ Asinta Ntinda Manyele Tanzania.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Vice Chairperson Tanzania Space Agency, Environmental, Social Safeguards, and Gender Focal person, EASTRIP- RAFIC project, Air Pollution Research Analyst and Senior Lecturer, Department of Environmental Science and Technology, University of Dar es Salaam."
  },
  {
    "name": "Ms. Piyaporn Singhathum",
    "image": "/img/Ambassadors/Ms_ Piyaporn Singhathum Ambassadorhailand.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Piyaporn Singhathum is an accomplished Physics teacher with over five years of experience in teaching physics, astronomy, and space technology at the secondary level. She holds a Bachelor of Education from Chulalongkorn University and is passionate about hands-on learning. Piyaporn has guided student teams to success in competitions like the Thailand Cansat-Rocket and School Satellite competitions. Piyaporn is certified in STK (System Tool Kit) and fluent in Thai and English, committed to fostering student interest in science."
  },
  {
    "name": "Ms. Shalmalee",
    "image": "/img/Ambassadors/Ms_ Shalmalee Solomon Islands Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Shalmalee is an accomplished professional with over six years of experience in international development, specializing in digital transparency and natural resource governance. Her work spans developing countries in East and West Africa and the Pacific region, focusing on enhancing governance systems through her role with the Norwegian Revenue Development Foundation (RDF). Currently based in the Solomon Islands, Shalmalee serves in dual roles with UNDP and RDF, implementing a World Bank-funded project within the Ministry of Mines and Energy. Her expertise lies in natural resource governance, conflict mineral transparency, and the digitization of government processes, driving impactful solutions for sustainable development."
  },
  {
    "name": "Ms. Hadidjatou Yaya",
    "image": "/img/Ambassadors/Ms_ Hadidjatou Yaya Togo Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Hadidjatou YAYA has a bachelor degree in Anglophone studies but works mostly in social programs. She has over 5 years of experience as a volunteer for social activities. She is a gender equality and climate advocate with advanced capabilities in project management and public speaking. Hadidjatou is a YALI Accra and a Mandela Washington Fellowship Alumna (2023). She has her own organisation called Impact For Development (Impact 4 Dev) to continue her work with vulnerable people, women, youth, and children in the areas of leadership, sustainable, equal opportunities, and climate adaptation towards sustainable development, especially in rural communities."
  },
  {
    "name": "Ms. Donna Scoon Moses",
    "image": "/img/Ambassadors/Ms_ Donna Scoon Moses Trinidad and Tobago Co Devi Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Donna Scoon-Moses is a retired Director and educator with a rich background in transformative training programs. Starting as Head of the Science Department at Bishop Anstey High School, she advanced to curriculum development roles within the Ministry of Training. As Director of the Retraining Programme at YTEPP Limited, Donna led impactful projects, including the Caribbean’s first Institute of Cosmetology and a Tilapia Production Training Facility, supporting retrenched workers and inmates in skill development. Recently, she has consulted on digital learning initiatives with the Ministry of Digital Transformation. Donna holds degrees in Chemistry, Biochemistry, and Education, alongside certifications in business management. She is also president of Soroptimist International of Port of Spain, dedicated to empowering women and girls to reach their full potential"
  },
  {
    "name": "Ms. Laura",
    "image": "/img/Ambassadors/Ms_ Laura Rambaran-Seepersad - Trinidad and Tobago Co-ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co Ambassador",
    "about": "Laura Rambaran-Seepersad is a dedicated leader in science, education, and public relations. She is the President of Soroptimist International Chaguanas and the PRO of CARISCIENCE, a UNESCO-affiliated NGO promoting science and technology in the Caribbean. She serves as a senior administrator at the University of the West Indies, spearheading initiatives like the Trinidad and Tobago Chemistry Olympiad and UWI-FST Science and Technology Week. With a background in environmental management, business, and occupational health and safety, Laura has held key roles in academia, corporate HSE, and cultural development. She has organized high-level conferences, developed national standards, and fostered industry-academic collaborations. Currently pursuing a PhD in Climate Change and Finance, she is passionate about sustainability, STEM outreach, and international diplomacy. Beyond her professional endeavors, she enjoys horse racing, dancing, and sports. Through her work, she continues to inspire and innovate across multiple fields."
  },
  {
    "name": "Ms. Soulaima Dhieb",
    "image": "/img/Ambassadors/Ms_  Soulaima Dhieb Tunisa Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Space Law Researcher, Customer Experience Manager at AIESEC University in Tunisia, International Relations Member - AIESEC University in Tunisia, and Founding Member of Club des Jeunes Publicistes."
  },
  {
    "name": "Ms.  Temitope Adeniyi",
    "image": "/img/Ambassadors/Mrs_  Temitope Adeniyi Nigeria Ambassador.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "An award-winning doctoral student and researcher at Cleveland State University, her work revolves around the cutting-edge intersection of Quantum Technologies and Artificial Intelligence (AI), She leads quantum computing workshops for Cleveland institutions and mentor high school students on Quantum computing and AI and She is a co-founder, Machine Learning Engineer, and Product Manager in tech startups, showcasing her ability as a passionate advocate for STEM education, particularly for women and girls."
  },
  {
    "name": "Ms. Maral Rejepova",
    "image": "/img/Ambassadors/Ms_ Maral Rejepova Turkmenistan Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassdor",
    "about": "I am Maral and I have worked in different areas of Telecommunications field for 5 years, ultimately gaining experience in B2B, B2C, and B2G relations (not exactly sales), customer negotiations, contracts development and improvement at satellite communication at a variety of levels. As a technician, I take pride in ensuring that my job is fully matching to my internal requirements and it's pleasure to me work there. I am always striving to bring 100% to the work that I do, and my goal as a specialist is to build strong, long term, mutually beneficial relationships with clients and consumers alike. Currently, I am working as a Senior Contracts Specialist, responsible for the preparation of contracts (icnluding preparation of draft versions), control over the fulfillment of contractual obligations, registration of contracts, and control of receivables and payables. In addition, working with the technical team at the Teleport, monitoring the status of RF and data equipments, and installing VSAT systems."
  },
  {
    "name": "Dr. Marwa Amarah",
    "image": "/img/Ambassadors/Dr_ Marwa Amarah UAE Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Dr. Marwa Amarah is a seasoned senior leader, educational consultant, and teaching-learning coach with over 16 years of impactful experience in school leadership and professional development. Known for driving transformative change, she has successfully improved student achievement by 25% across institutions. Her expertise spans strategy, government relations, and resource allocation. Dr. Amarah has held leadership roles with the UAE Ministry of Education and Aldar Education, specializing in instructional coaching and systemic improvement. With a doctorate in human development and a master’s in educational leadership, she is committed to empowering educators and shaping future-ready learning environments across the Middle East."
  },
  {
    "name": "Ms. Connie Kekihembo",
    "image": "/img/Ambassadors/Ms_ Connie Kekihembo Uganda.jpeg",
    "ambassadorRole": "Ambassador",
    "about": "Connie Kekihembo is a distinguished Women Economic Empowerment Expert and a leading continental voice in advancing women’s entrepreneurship, inclusive trade, and economic policy in Africa. With over two decades of experience, she has driven large-scale initiatives that have empowered more than 6.3 million women entrepreneurs across East Africa through access to finance, markets, and digital tools. Her work spans policy advocacy, institutional leadership, and regional integration in collaboration with global partners including UN Women and the African Development Bank. She is also an ardent advocate for children with disabilities. In recognition of her outstanding impact, she was recently named among the 100 Most Influential Women in Africa (2025) for excellence in women’s economic empowerment."
  },
  {
    "name": "Ms. Sheeba Niwensiima",
    "image": "/img/Ambassadors/Ms_ Sheeba Niwensiima Uganda Ambassador.jpg",
    "ambassadorRole": "Tech-Ambassador",
    "about": "Sheeba Niwensiima is an exceptional MedTech entrepreneur and policy advocate from Uganda, recognized as one of Africa's Top 50 Outstanding Women in Tech. As the CTO and Project Manager of PhotoKabada Ltd, she is leading the development of innovative medical devices like the PhotoKabada, a revolutionary solution for neonatal jaundice. She is also the User Experience Manager at Yiya Engineering Solutions, where she is transforming STEM education for marginalized communities. With a passion for responsible innovation and youth empowerment, Sheeba is a trailblazer in Africa’s tech space, committed to making a global impact through her work"
  },
  {
    "name": "Ms. Kinjal Dave",
    "image": "/img/Ambassadors/Ms_ Kinjal Dave UK Devi Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Defence consultant for CORDA, Scientist at BAE Systems Digital Intelligence, TechWomen100, Asian Women of Achievement Award, STEM Ambassador, Diversity and Inclusion Advocate, Dancer, Atomic Ambassador and a Public Speaker"
  },
  {
    "name": "Dr. Mariana García",
    "image": "/img/Ambassadors/Dr_ Mariana García Uruguay Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Mariana García, Doctor of Law and Social Sciences from Universidad de la República, Uruguay, is a distinguished expert in aeronautical, air transport, and space law. With 15 years of professional experience, she has served as a legal advisor to Uruguay's Policia Aerea Nacional and is currently an advisor to the Uruguayan Air Force. Mariana is deeply involved in space legislation and policy, leading initiatives such as the space law project launched by the Uruguayan Air Force in 2021. In 2023, she was appointed Director General of the Aeronautical and Space Research and Communications Center, contributing to the study of space law and diplomacy globally. Mariana is a scholar of the U.S. Department of State’s International Visitor Leadership Program, focusing on the role of emerging spacefaring nations. She is actively engaged with organizations like the Ibero-American Institute of Aeronautical and Space Law and Space for Women LA. Mariana has represented Uruguay at prestigious international forums, including the Space Conference of the Americas, the EU-Latin America Space Cooperation Workshop, and the FIDAE Space Summit. Her contributions extend to academic publications, policy discussions, and fostering international collaboration in space law and governance."
  },
  {
    "name": "Ms. Mohina Rustamova",
    "image": "/img/Ambassadors/Ms_ Mohina Rustamova Uzbegistan Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Mohina Rustamova, a passionate advocate for STEM education, majoring in Artificial Intelligence and Robotics. As an alumna of programs like TechGirls and Technovation Girls, I am committed to empowering young minds and bridging the gender gap in technology. I had the privilege of contributing to UniSat 2.0, a transformative program in Uzbekistan that engages girls in satellite development and fosters their passion for space technology. Representing Uzbekistan, I am dedicated to mentoring and inspiring young girls to become future leaders in space exploration and beyond."
  },
  {
    "name": "Ms. Tran Hang",
    "image": "/img/Ambassadors/Ms_ Trần Thị Hằng Vietnam Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Trần Thị Hằng is a dedicated educational innovator working to modernize Vietnam’s education system. She is the Founder and CEO of My Bridge Education Co., Ltd. and IDEAS Education Joint Stock Company. As a strategic partner of Google for Education and a global training partner of Microsoft for Education, she champions digital transformation in learning. Her past roles include Project Manager at the National Foreign Language Project, teacher at Vietnam National University, and Academic Director for Hudson Global Scholars. With a passion for meaningful change, she strives to contribute to building a globally connected, future-ready education system in Vietnam."
  },
  {
    "name": "Ms. Bertha",
    "image": "/img/Ambassadors/Ms_ Birtha Zambia Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Bertha is a passionate educator and administrator with a strong commitment to empowering young girls. Currently pursuing a Bachelor of Arts in Education part-time, she combines her academic journey with impactful roles in education and mentorship. As the coordinator of a school of 300 girls, Bertha ensures smooth operations by providing logistical and administrative support, fostering an environment conducive to effective teaching and learning. She also serves as the Angel Parents' Local Coordinator, overseeing and updating vital information about the girls under the Angel Parent program to ensure their well-being and progress. Beyond her administrative responsibilities, Bertha nurtures young minds through astronomy. She leads an Astronaut Club of 20 girls aged 8 to 10, introducing them to the wonders of space and inspiring a love for science. Her dedication exemplifies her vision for empowering girls through education and mentorship."
  },
  {
    "name": "Dr. Electdom Matandirotya",
    "image": "/img/Ambassadors/Ms_ Primerose Bomokayi Zimbabwe Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Chief Scientist at the Zimbabwe National Geospatial and Space Agency (ZINGSA), acting Director for the Space Science department, senior Lecturer at the University of Zimbabwe, and active member of Women in Physics (Zimbabwe and Women in Engineering (University of Zimbabwe)."
  },
  {
    "name": "Ms. Primerose Bomokayi",
    "image": "/img/Ambassadors/Ms_ Primerose Bomokayi Zimbabwe Ambassador - Mission Shakthisat.jpg",
    "ambassadorRole": "Co - Ambassador",
    "about": "Primerose Bomokayi is an Engineer at Zimbabwe National Geospatial and Space Agency (ZINGSA), specialising in aerospace and aviation. With a background in aircraft maintenance engineering, she has honed her skills in aircraft avionics and electrical systems, working across various aircraft types including helicopters, military jets, cargo and unmanned aerial vehicles (drones). Her expertise extends from electronics to nanoscience and nanotechnology, holding a B.Tech Honors and an M.Sc in those respective fields. Dedicated to nurturing the next generation of engineers and aviators, Primerose is actively involved in tutoring apprentices in aircraft maintenance engineering as well as undergraduate students in Space Science and Applied Physics. Her unwavering commitment to innovation and is evident in her professional philosophy on the sky not being the limit, but rather another dimension awaiting exploration."
  },
  {
    "name": "Ms. Melody Marasha",
    "image": "/img/Ambassadors/Ms_ Melody Marasha Zimbabway Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Co - Ambassador",
    "about": "Melody Marasha advocates for gender equality and climate action and has a background in science education and policy development. She holds a Bachelor's in Biochemistry from the University of the Witwatersrand and a Postgraduate Diploma in Education. She started as a science teacher, using innovative methods to inspire her students. She then joined the Ministry of Higher and Tertiary Education as a Programs Officer, shaping policies that promote scientific advancement and collaboration. Additionally, she is a prominent advocate for gender equality in STEM and integrates gender perspectives into environmental policies, driving impactful changes in her fields of advocacy."
  },
  {
    "name": "Ms. Jasmine Koria",
    "image": "/img/Ambassadors/Ms_ Jasmine Koria Samoa Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Jasmine Koria is an educator, artist, international representative and Commonwealth Scholar from the Independent State of Samoa. She has over a decade of experience in youth work, and has a great passion for utilizing education to address global equity issues and improve international relations. She holds a B.A in International Relations, Political Science and English Literature from the Victoria University of Wellington, New Zealand, a Certificate IV in Adult Teaching from the National University of Samoa, and is pursuing an M.A in Online Teaching at the U.K's Open University."
  },
  {
    "name": "Ms. Priscilla Tagutanazvo",
    "image": "/img/Ambassadors/Ms_ Priscilla Tagutanazvo Zimbabwe Ambassador Poster.jpg",
    "ambassadorRole": "Co-Ambassador",
    "about": "Priscilla Tagutanazvo is a space engineering technician at Zimbabwe National Geospatial and Space Agency. She holds B.Eng. Honors degree in Telecommunications engineering. Her work supports Satellite communications and Unmanned Aerial Vehicle technology. She is a certified Pilot and licenced Drone Maintenance Technician. Priscilla inspires girls in STEM by taking part in STEM programmes and exhibitions, proving that skill and determination can thrive in male-dominated fields. Her contributions continue to drive progress in Telecommunications, Space Engineering, and Drone Technology industries. Priscilla is also very passionate about Space Exploration and the impact it’s bringing to the world."
  },
  
  {
    "name": "Ms. Nikita Anilkumar",
    "image": "/img/Ambassadors/Ms_ Nikita Anilkumar Canada Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "I’m Nikita Anilkumar, an aerospace engineer and MBA graduate with a passion for innovation, empowerment, and creating meaningful impact. My journey combines technical expertise with business acumen, from contributing to aerospace research to driving community initiatives that uplift women in entrepreneurship and STEM. I believe in the power of curiosity, lifelong learning, and inspiring others to reach beyond limits."
  },
  {
    "name": "Ms. Thanh Nguyen",
    "image": "/img/Ambassadors/Ms_ Thanh Nguyen Vietnam Ambassador Poster.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Thanh Nguyen is a Vietnamese data scientist and AI enthusiast passionate about using technology to solve real-world challenges. She holds a Master’s degree in European Economics and Business Law from Italy and brings four years of experience at the United Nations World Food Programme, where she applies data science to drive global initiatives. Thanh is driven by the belief that data and AI can create efficient, innovative, and sustainable solutions. She continues to strengthen her technical and analytical skills, inspiring young women to explore STEM fields and harness technology to make a positive impact on the world."
  },
  {
    "name": "Ms. Carmen M. Nzamba",
    "image": "/img/Ambassadors/Ms_ Carmen M_ Nzamba Ambassador of Republic of Gabon.jpg",
    "ambassadorRole": "Co-ambassador",
    "about": "Carmen M. Nzamba is a seasoned global education specialist, entrepreneur and student mentor with over 15 years of experience teaching English in high schools, universities, and business institutions. She founded her own training business in 2021 and actively organizes academic conferences, business events, and webinars for international students and entrepreneurs. Since February 2025, she has served as the G100 France Country Chair for Global Networking. Carmen is also the founder and president of Buy & Promote Africa First (B-PAF) since 2020, and a committed volunteer with “100000 Entrepreneurs.” Her initiatives include launching a virtual company project for high schoolers, creating a “Parents Club” to support study trips, and founding the “Jeunes Ambassadeurs et Leaders d’Afrik” program. With a strong academic background in U.S. foreign policy and diplomacy, she was a visiting researcher in Montreal in 2010 and worked as a media consultant for TV5 and RFI from 2011 to 2012."
  },
  {
    "name": "Ms. Natasha Lumpa",
    "image": "/img/Ambassadors/Ms_ Natasha Lumpa Zambia Co-Ambassador.jpg",
    "ambassadorRole": "Co-ambassador",
    "about": "Natasha Lumpa is a passionate development practitioner and Project Officer at She Entrepreneur Zambia, where she supports women through business development training, mentorship, and networking. With a diploma in Primary Education and currently pursuing a degree in Development Studies, Natasha combines her background in education with her commitment to community empowerment. She is driven by a vision to create lasting social impact, particularly through women empowerment events, youth leadership seminars, and literacy initiatives."
  },
  {
    "name": "Ms. Charmaine Mangion",
    "image": "/img/Ambassadors/Ms_ Charmaine Mangion Malta Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Charmaine Mangion is the Founder and Managing Director of Magic Castle Waldorf Childcare, Malta’s first Steiner Waldorf-inspired childcare centre, launched in 2014. Starting her business at just 21, she identified a need for holistic, screen-free early childhood education. Her enterprise has grown into MC Innovative Ltd, operating a chain of centres. Charmaine has received national recognition, including Company of Excellence and National Young Businesswoman of the Year awards. She also chairs the Consultative Council for Women’s Rights, advocating for gender equality. She holds qualifications in leadership, business, and early education, and is currently pursuing an LL.B. at the University of Malta."
  },
  {
    "name": "Ms. Wanjiku Chebet Kanjumba",
    "image": "/img/Ambassadors/Ms_ Wanjiku Chebet Kanjumba Kenya Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Wanjiku Chebet Kanjumba is a Kenyan aerospace engineer, futurist, and space advocate dedicated to advancing humanity’s presence in space. She holds Bachelor’s and Master’s degrees in Aerospace Engineering, with a minor in Space Operations, and is pursuing a Ph.D. in Aerospace Engineering. Wanjiku works on projects like the Omega Spaceport, aimed at expanding space access for Africa, Asia, and Oceania. She has contributed to NASA and ESA initiatives and trained as a PoSSUM Scientist-Astronaut. Selected as a Titans Space R&D Astronaut-Candidate, Wanjiku is passionate about STEM outreach and inspiring the next generation of space explorers."
  },
  {
    "name": "Ms. Devica Kamini Uditram",
    "image": "/img/Ambassadors/Ms_ Devica Kamini Uditram Guyana Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Ms. Devica Kamini Uditram is a finance professional with over a decade of experience in banking and public service, currently serving as an Economic and Financial Analyst at Guyana’s Ministry of Finance. She tutors at Green State Technical University and is pursuing postgraduate studies in Strategic Development Studies. Passionate about community service, Devica has led literacy, health, and mental health initiatives benefiting thousands across Guyana. She is the founder of The Literary Coven GY Book Club and a mentor for Youth Parliament. Her contributions have earned her a National Youth Award, 25 Influential Women Leaders Award, and 30 under 30 Changemaker Award."
  },
  {
    "name": "Ms. Jessica Golding",
    "image": "/img/Ambassadors/Ms_ Jessica Golding Jamaica Co-Ambassador.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Jessica Golding is a passionate teacher dedicated to empowering students to reach their full potential. She is currently pursuing a Bachelor's degree at Moneague College, where her academic journey has fueled her growth and commitment to education. Deeply invested in the development of girls, Jessica actively participates in initiatives that promote empowerment and equality. As a proud recipient of the prestigious Doreen Clemtson Scholarship, she honors the legacy of service and leadership within Girl Guides Jamaica. Residing in Victoria District, Linstead, St. Catherine, Jessica continues to inspire through her work, embodying the values of compassion, leadership, and community service."
  },
  {
    "name": "Ms. Nongbzanga Ariane Fabiola Ouedraogo",
    "image": "/img/Ambassadors/Ms_ Nongbzanga Ariane Fabiola Ouedraogo Ambassador Poster.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Nongbzanga Ariane Fabiola Ouedraogo is a Computer Science major with a Mathematics minor in the United States. She is the President and Founder of Duni Paale and Women in Science and Technology (WISAT), organizations dedicated to empowering youth, advancing women in STEM, and fostering leadership. A passionate STEM advocate, she is committed to service, helping vulnerable communities, and inspiring the next generation to harness science and technology for positive change."
  },
  {
    "name": "Ms. Ketra Polydore",
    "image": "/img/Ambassadors/Ms_ KETRA POLYDORE Dominica Ambassador - Mission ShakthiSAT.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Ketra Polydore is a results-oriented professional with over 6 years of experience in legal administration, project management, and customer support, specializing in law firm operations, including Companies, Intellectual Property, and Citizenship by Investment processes. She consistently delivers high-quality client services while efficiently managing documentation and compliance within legal frameworks. As a Senior Clerk, Ketra is adept at coordinating teams, streamlining workflows, and ensuring the accuracy and timeliness of critical legal filings. Her strong leadership, honed through Agile Project Management, combined with her proficiency in SQL and Strategic Management, allows her to integrate technology and business strategies to enhance operational efficiency. Beyond her professional expertise, Ketra is an active community leader and athlete. She organizes monthly sports tournaments in her local community, handling logistics and participant engagement, contributing to both community building and club growth. As an elected Counselor for the Pointe Michel Village Council, she plays an active role in improving residents' quality of life. Ketra is also a proud member of JCI Dominica, demonstrating her commitment to leadership, community service, and continuous development."
  },
  {
    "name": "Ms. Fiorella Arias-Bonilla",
    "image": "/img/Ambassadors/Fiorella Arias-Bonilla - Costa Rica Co-Ambassador.jpg",
    "ambassadorRole": "Co-ambassador",
    "about": "Fiorella Arias Bonilla is a Biotechnology Engineer from Costa Rica with experience in agricultural biotechnology, science diplomacy, and space sciences. As a Visiting Scholar at UC Davis, she researched functionalized hydrogels for Bioregenerative Life Support Systems and earned recognition for her thesis on sustainable agricultural systems for space habitats. She co-founded Orbital Space Technologies and ACACIE and has been honored as an Emerging Space Leader, Global Rising Star, LATAM Biotech Leader, and Forbes 30 Under 30 Central America awardee. A winner of the 2025 Space Station Design Workshop, she is dedicated to sustainability, rural development, BLiSS, mental health, and women’s rights."
  },
  {
    "name": "Ms. Daniela Jovic",
    "image": "/img/Ambassadors/Ms_ Daniela Jovic Ambassador Croatia.jpg",
    "ambassadorRole": "Ambassador",
    "about": "Daniela Jovic is a space industry consultant, public speaker, and the founder of ORBITALYX, a company supporting satellite missions, business development, and communications across the NewSpace sector. She has led multiple satellite projects, including Croatia’s first satellite, CroCube, and collaborates with institutions, companies, and events across Europe and beyond. Her work spans mission coordination, launch strategy, brand positioning, and public engagement. Through every role, Daniela actively promotes visibility, inclusion, and access to space for emerging professionals and underrepresented communities, with a strong focus on education, storytelling, and cross-sector collaboration."
  }
]
